/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const VA_PICTURE_HEVC_RPS_ST_CURR_BEFORE: u32 = 16;
pub const VA_PICTURE_HEVC_RPS_ST_CURR_AFTER: u32 = 32;
pub const VA_PICTURE_HEVC_RPS_LT_CURR: u32 = 64;
pub const VA_PICTURE_VVC_INVALID: u32 = 1;
pub const VA_PICTURE_VVC_LONG_TERM_REFERENCE: u32 = 2;
pub const VA_PICTURE_VVC_UNAVAILABLE_REFERENCE: u32 = 4;
pub const HEVC_LAST_PICTURE_EOSEQ: u32 = 1;
pub const HEVC_LAST_PICTURE_EOSTREAM: u32 = 2;
pub const VA_FEI_FUNCTION_ENC: u32 = 1;
pub const VA_FEI_FUNCTION_PAK: u32 = 2;
pub const VA_FEI_FUNCTION_ENC_PAK: u32 = 4;
pub const VA_PICTURE_STATS_INVALID: u32 = 1;
pub const VA_PICTURE_STATS_PROGRESSIVE: u32 = 0;
pub const VA_PICTURE_STATS_TOP_FIELD: u32 = 2;
pub const VA_PICTURE_STATS_BOTTOM_FIELD: u32 = 4;
pub const VA_PICTURE_STATS_CONTENT_UPDATED: u32 = 16;
pub const H264_LAST_PICTURE_EOSEQ: u32 = 1;
pub const H264_LAST_PICTURE_EOSTREAM: u32 = 2;
pub const VA_MB_PRED_AVAIL_TOP_LEFT: u32 = 4;
pub const VA_MB_PRED_AVAIL_TOP: u32 = 16;
pub const VA_MB_PRED_AVAIL_TOP_RIGHT: u32 = 8;
pub const VA_MB_PRED_AVAIL_LEFT: u32 = 64;
pub const VA_AV1_MAX_SEGMENTS: u32 = 8;
pub const VA_AV1_SEG_LVL_MAX: u32 = 8;
pub const VA_BLEND_GLOBAL_ALPHA: u32 = 1;
pub const VA_BLEND_PREMULTIPLIED_ALPHA: u32 = 2;
pub const VA_BLEND_LUMA_KEY: u32 = 16;
pub const VA_PROC_PIPELINE_SUBPICTURES: u32 = 1;
pub const VA_PROC_PIPELINE_FAST: u32 = 2;
pub const VA_PROC_FILTER_MANDATORY: u32 = 1;
pub const VA_PIPELINE_FLAG_END: u32 = 4;
pub const VA_CHROMA_SITING_UNKNOWN: u32 = 0;
pub const VA_CHROMA_SITING_VERTICAL_TOP: u32 = 1;
pub const VA_CHROMA_SITING_VERTICAL_CENTER: u32 = 2;
pub const VA_CHROMA_SITING_VERTICAL_BOTTOM: u32 = 3;
pub const VA_CHROMA_SITING_HORIZONTAL_LEFT: u32 = 4;
pub const VA_CHROMA_SITING_HORIZONTAL_CENTER: u32 = 8;
pub const VA_SOURCE_RANGE_UNKNOWN: u32 = 0;
pub const VA_SOURCE_RANGE_REDUCED: u32 = 1;
pub const VA_SOURCE_RANGE_FULL: u32 = 2;
pub const VA_TONE_MAPPING_HDR_TO_HDR: u32 = 1;
pub const VA_TONE_MAPPING_HDR_TO_SDR: u32 = 2;
pub const VA_TONE_MAPPING_HDR_TO_EDR: u32 = 4;
pub const VA_TONE_MAPPING_SDR_TO_HDR: u32 = 8;
pub const VA_DEINTERLACING_BOTTOM_FIELD_FIRST: u32 = 1;
pub const VA_DEINTERLACING_BOTTOM_FIELD: u32 = 2;
pub const VA_DEINTERLACING_ONE_FIELD: u32 = 4;
pub const VA_DEINTERLACING_FMD_ENABLE: u32 = 8;
pub const VA_DEINTERLACING_SCD_ENABLE: u32 = 16;
pub const VA_PROC_HVS_DENOISE_DEFAULT: u32 = 0;
pub const VA_PROC_HVS_DENOISE_AUTO_BDRATE: u32 = 1;
pub const VA_PROC_HVS_DENOISE_AUTO_SUBJECTIVE: u32 = 2;
pub const VA_PROC_HVS_DENOISE_MANUAL: u32 = 3;
pub const VA_3DLUT_CHANNEL_UNKNOWN: u32 = 0;
pub const VA_3DLUT_CHANNEL_RGB_RGB: u32 = 1;
pub const VA_3DLUT_CHANNEL_YUV_RGB: u32 = 2;
pub const VA_3DLUT_CHANNEL_VUY_RGB: u32 = 4;
pub type VADisplay = *mut ::std::os::raw::c_void;
pub type VAStatus = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VARectangle {
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VARectangle"][::std::mem::size_of::<_VARectangle>() - 8usize];
    ["Alignment of _VARectangle"][::std::mem::align_of::<_VARectangle>() - 2usize];
    ["Offset of field: _VARectangle::x"][::std::mem::offset_of!(_VARectangle, x) - 0usize];
    ["Offset of field: _VARectangle::y"][::std::mem::offset_of!(_VARectangle, y) - 2usize];
    ["Offset of field: _VARectangle::width"][::std::mem::offset_of!(_VARectangle, width) - 4usize];
    ["Offset of field: _VARectangle::height"]
        [::std::mem::offset_of!(_VARectangle, height) - 6usize];
};
pub type VARectangle = _VARectangle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAMotionVector {
    pub mv0: [i16; 2usize],
    pub mv1: [i16; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAMotionVector"][::std::mem::size_of::<_VAMotionVector>() - 8usize];
    ["Alignment of _VAMotionVector"][::std::mem::align_of::<_VAMotionVector>() - 2usize];
    ["Offset of field: _VAMotionVector::mv0"]
        [::std::mem::offset_of!(_VAMotionVector, mv0) - 0usize];
    ["Offset of field: _VAMotionVector::mv1"]
        [::std::mem::offset_of!(_VAMotionVector, mv1) - 4usize];
};
pub type VAMotionVector = _VAMotionVector;
pub type VAMessageCallback = ::std::option::Option<
    unsafe extern "C" fn(
        user_context: *mut ::std::os::raw::c_void,
        message: *const ::std::os::raw::c_char,
    ),
>;
pub type VANativeDisplay = *mut ::std::os::raw::c_void;
pub type VAPrivFunc = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub const VAProfileNone: VAProfile = -1;
pub const VAProfileMPEG2Simple: VAProfile = 0;
pub const VAProfileMPEG2Main: VAProfile = 1;
pub const VAProfileMPEG4Simple: VAProfile = 2;
pub const VAProfileMPEG4AdvancedSimple: VAProfile = 3;
pub const VAProfileMPEG4Main: VAProfile = 4;
pub const VAProfileH264Baseline: VAProfile = 5;
pub const VAProfileH264Main: VAProfile = 6;
pub const VAProfileH264High: VAProfile = 7;
pub const VAProfileVC1Simple: VAProfile = 8;
pub const VAProfileVC1Main: VAProfile = 9;
pub const VAProfileVC1Advanced: VAProfile = 10;
pub const VAProfileH263Baseline: VAProfile = 11;
pub const VAProfileJPEGBaseline: VAProfile = 12;
pub const VAProfileH264ConstrainedBaseline: VAProfile = 13;
pub const VAProfileVP8Version0_3: VAProfile = 14;
pub const VAProfileH264MultiviewHigh: VAProfile = 15;
pub const VAProfileH264StereoHigh: VAProfile = 16;
pub const VAProfileHEVCMain: VAProfile = 17;
pub const VAProfileHEVCMain10: VAProfile = 18;
pub const VAProfileVP9Profile0: VAProfile = 19;
pub const VAProfileVP9Profile1: VAProfile = 20;
pub const VAProfileVP9Profile2: VAProfile = 21;
pub const VAProfileVP9Profile3: VAProfile = 22;
pub const VAProfileHEVCMain12: VAProfile = 23;
pub const VAProfileHEVCMain422_10: VAProfile = 24;
pub const VAProfileHEVCMain422_12: VAProfile = 25;
pub const VAProfileHEVCMain444: VAProfile = 26;
pub const VAProfileHEVCMain444_10: VAProfile = 27;
pub const VAProfileHEVCMain444_12: VAProfile = 28;
pub const VAProfileHEVCSccMain: VAProfile = 29;
pub const VAProfileHEVCSccMain10: VAProfile = 30;
pub const VAProfileHEVCSccMain444: VAProfile = 31;
pub const VAProfileAV1Profile0: VAProfile = 32;
pub const VAProfileAV1Profile1: VAProfile = 33;
pub const VAProfileHEVCSccMain444_10: VAProfile = 34;
pub const VAProfileProtected: VAProfile = 35;
pub const VAProfileH264High10: VAProfile = 36;
pub const VAProfileVVCMain10: VAProfile = 37;
pub const VAProfileVVCMultilayerMain10: VAProfile = 38;
pub type VAProfile = ::std::os::raw::c_int;
pub const VAEntrypointVLD: VAEntrypoint = 1;
pub const VAEntrypointIZZ: VAEntrypoint = 2;
pub const VAEntrypointIDCT: VAEntrypoint = 3;
pub const VAEntrypointMoComp: VAEntrypoint = 4;
pub const VAEntrypointDeblocking: VAEntrypoint = 5;
pub const VAEntrypointEncSlice: VAEntrypoint = 6;
pub const VAEntrypointEncPicture: VAEntrypoint = 7;
pub const VAEntrypointEncSliceLP: VAEntrypoint = 8;
pub const VAEntrypointVideoProc: VAEntrypoint = 10;
pub const VAEntrypointFEI: VAEntrypoint = 11;
pub const VAEntrypointStats: VAEntrypoint = 12;
pub const VAEntrypointProtectedTEEComm: VAEntrypoint = 13;
pub const VAEntrypointProtectedContent: VAEntrypoint = 14;
pub type VAEntrypoint = ::std::os::raw::c_uint;
pub const VAConfigAttribRTFormat: VAConfigAttribType = 0;
pub const VAConfigAttribSpatialResidual: VAConfigAttribType = 1;
pub const VAConfigAttribSpatialClipping: VAConfigAttribType = 2;
pub const VAConfigAttribIntraResidual: VAConfigAttribType = 3;
pub const VAConfigAttribEncryption: VAConfigAttribType = 4;
pub const VAConfigAttribRateControl: VAConfigAttribType = 5;
pub const VAConfigAttribDecSliceMode: VAConfigAttribType = 6;
pub const VAConfigAttribDecJPEG: VAConfigAttribType = 7;
pub const VAConfigAttribDecProcessing: VAConfigAttribType = 8;
pub const VAConfigAttribEncPackedHeaders: VAConfigAttribType = 10;
pub const VAConfigAttribEncInterlaced: VAConfigAttribType = 11;
pub const VAConfigAttribEncMaxRefFrames: VAConfigAttribType = 13;
pub const VAConfigAttribEncMaxSlices: VAConfigAttribType = 14;
pub const VAConfigAttribEncSliceStructure: VAConfigAttribType = 15;
pub const VAConfigAttribEncMacroblockInfo: VAConfigAttribType = 16;
pub const VAConfigAttribMaxPictureWidth: VAConfigAttribType = 18;
pub const VAConfigAttribMaxPictureHeight: VAConfigAttribType = 19;
pub const VAConfigAttribEncJPEG: VAConfigAttribType = 20;
pub const VAConfigAttribEncQualityRange: VAConfigAttribType = 21;
pub const VAConfigAttribEncQuantization: VAConfigAttribType = 22;
pub const VAConfigAttribEncIntraRefresh: VAConfigAttribType = 23;
pub const VAConfigAttribEncSkipFrame: VAConfigAttribType = 24;
pub const VAConfigAttribEncROI: VAConfigAttribType = 25;
pub const VAConfigAttribEncRateControlExt: VAConfigAttribType = 26;
pub const VAConfigAttribProcessingRate: VAConfigAttribType = 27;
pub const VAConfigAttribEncDirtyRect: VAConfigAttribType = 28;
pub const VAConfigAttribEncParallelRateControl: VAConfigAttribType = 29;
pub const VAConfigAttribEncDynamicScaling: VAConfigAttribType = 30;
pub const VAConfigAttribFrameSizeToleranceSupport: VAConfigAttribType = 31;
pub const VAConfigAttribFEIFunctionType: VAConfigAttribType = 32;
pub const VAConfigAttribFEIMVPredictors: VAConfigAttribType = 33;
pub const VAConfigAttribStats: VAConfigAttribType = 34;
pub const VAConfigAttribEncTileSupport: VAConfigAttribType = 35;
pub const VAConfigAttribCustomRoundingControl: VAConfigAttribType = 36;
pub const VAConfigAttribQPBlockSize: VAConfigAttribType = 37;
pub const VAConfigAttribMaxFrameSize: VAConfigAttribType = 38;
pub const VAConfigAttribPredictionDirection: VAConfigAttribType = 39;
pub const VAConfigAttribMultipleFrame: VAConfigAttribType = 40;
pub const VAConfigAttribContextPriority: VAConfigAttribType = 41;
pub const VAConfigAttribDecAV1Features: VAConfigAttribType = 42;
pub const VAConfigAttribTEEType: VAConfigAttribType = 43;
pub const VAConfigAttribTEETypeClient: VAConfigAttribType = 44;
pub const VAConfigAttribProtectedContentCipherAlgorithm: VAConfigAttribType = 45;
pub const VAConfigAttribProtectedContentCipherBlockSize: VAConfigAttribType = 46;
pub const VAConfigAttribProtectedContentCipherMode: VAConfigAttribType = 47;
pub const VAConfigAttribProtectedContentCipherSampleType: VAConfigAttribType = 48;
pub const VAConfigAttribProtectedContentUsage: VAConfigAttribType = 49;
pub const VAConfigAttribEncHEVCFeatures: VAConfigAttribType = 50;
pub const VAConfigAttribEncHEVCBlockSizes: VAConfigAttribType = 51;
pub const VAConfigAttribEncAV1: VAConfigAttribType = 52;
pub const VAConfigAttribEncAV1Ext1: VAConfigAttribType = 53;
pub const VAConfigAttribEncAV1Ext2: VAConfigAttribType = 54;
pub const VAConfigAttribEncPerBlockControl: VAConfigAttribType = 55;
pub const VAConfigAttribEncMaxTileRows: VAConfigAttribType = 56;
pub const VAConfigAttribEncMaxTileCols: VAConfigAttribType = 57;
pub const VAConfigAttribTypeMax: VAConfigAttribType = 58;
pub type VAConfigAttribType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttrib {
    pub type_: VAConfigAttribType,
    pub value: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttrib"][::std::mem::size_of::<_VAConfigAttrib>() - 8usize];
    ["Alignment of _VAConfigAttrib"][::std::mem::align_of::<_VAConfigAttrib>() - 4usize];
    ["Offset of field: _VAConfigAttrib::type_"]
        [::std::mem::offset_of!(_VAConfigAttrib, type_) - 0usize];
    ["Offset of field: _VAConfigAttrib::value"]
        [::std::mem::offset_of!(_VAConfigAttrib, value) - 4usize];
};
pub type VAConfigAttrib = _VAConfigAttrib;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValDecJPEG {
    pub bits: _VAConfigAttribValDecJPEG__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValDecJPEG__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValDecJPEG__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValDecJPEG__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValDecJPEG__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValDecJPEG__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValDecJPEG__bindgen_ty_1 {
    #[inline]
    pub fn rotation(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_rotation(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn crop(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_crop(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 27u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 27u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        rotation: u32,
        crop: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let rotation: u32 = unsafe { ::std::mem::transmute(rotation) };
            rotation as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let crop: u32 = unsafe { ::std::mem::transmute(crop) };
            crop as u64
        });
        __bindgen_bitfield_unit.set(5usize, 27u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValDecJPEG"]
        [::std::mem::size_of::<_VAConfigAttribValDecJPEG>() - 4usize];
    ["Alignment of _VAConfigAttribValDecJPEG"]
        [::std::mem::align_of::<_VAConfigAttribValDecJPEG>() - 4usize];
    ["Offset of field: _VAConfigAttribValDecJPEG::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValDecJPEG, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValDecJPEG::value"]
        [::std::mem::offset_of!(_VAConfigAttribValDecJPEG, value) - 0usize];
};
pub type VAConfigAttribValDecJPEG = _VAConfigAttribValDecJPEG;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValMaxFrameSize {
    pub bits: _VAConfigAttribValMaxFrameSize__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValMaxFrameSize__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValMaxFrameSize__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValMaxFrameSize__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValMaxFrameSize__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValMaxFrameSize__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValMaxFrameSize__bindgen_ty_1 {
    #[inline]
    pub fn max_frame_size(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_max_frame_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn multiple_pass(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_multiple_pass(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        max_frame_size: u32,
        multiple_pass: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let max_frame_size: u32 = unsafe { ::std::mem::transmute(max_frame_size) };
            max_frame_size as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let multiple_pass: u32 = unsafe { ::std::mem::transmute(multiple_pass) };
            multiple_pass as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValMaxFrameSize"]
        [::std::mem::size_of::<_VAConfigAttribValMaxFrameSize>() - 4usize];
    ["Alignment of _VAConfigAttribValMaxFrameSize"]
        [::std::mem::align_of::<_VAConfigAttribValMaxFrameSize>() - 4usize];
    ["Offset of field: _VAConfigAttribValMaxFrameSize::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValMaxFrameSize, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValMaxFrameSize::value"]
        [::std::mem::offset_of!(_VAConfigAttribValMaxFrameSize, value) - 0usize];
};
pub type VAConfigAttribValMaxFrameSize = _VAConfigAttribValMaxFrameSize;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValEncJPEG {
    pub bits: _VAConfigAttribValEncJPEG__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValEncJPEG__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncJPEG__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValEncJPEG__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValEncJPEG__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValEncJPEG__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValEncJPEG__bindgen_ty_1 {
    #[inline]
    pub fn arithmatic_coding_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_arithmatic_coding_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn progressive_dct_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_progressive_dct_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn non_interleaved_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_non_interleaved_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn differential_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_differential_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_components(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_components(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_scans(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_scans(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_huffman_tables(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_huffman_tables(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_quantization_tables(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_quantization_tables(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        arithmatic_coding_mode: u32,
        progressive_dct_mode: u32,
        non_interleaved_mode: u32,
        differential_mode: u32,
        max_num_components: u32,
        max_num_scans: u32,
        max_num_huffman_tables: u32,
        max_num_quantization_tables: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let arithmatic_coding_mode: u32 =
                unsafe { ::std::mem::transmute(arithmatic_coding_mode) };
            arithmatic_coding_mode as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let progressive_dct_mode: u32 = unsafe { ::std::mem::transmute(progressive_dct_mode) };
            progressive_dct_mode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let non_interleaved_mode: u32 = unsafe { ::std::mem::transmute(non_interleaved_mode) };
            non_interleaved_mode as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let differential_mode: u32 = unsafe { ::std::mem::transmute(differential_mode) };
            differential_mode as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let max_num_components: u32 = unsafe { ::std::mem::transmute(max_num_components) };
            max_num_components as u64
        });
        __bindgen_bitfield_unit.set(7usize, 4u8, {
            let max_num_scans: u32 = unsafe { ::std::mem::transmute(max_num_scans) };
            max_num_scans as u64
        });
        __bindgen_bitfield_unit.set(11usize, 3u8, {
            let max_num_huffman_tables: u32 =
                unsafe { ::std::mem::transmute(max_num_huffman_tables) };
            max_num_huffman_tables as u64
        });
        __bindgen_bitfield_unit.set(14usize, 3u8, {
            let max_num_quantization_tables: u32 =
                unsafe { ::std::mem::transmute(max_num_quantization_tables) };
            max_num_quantization_tables as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncJPEG"]
        [::std::mem::size_of::<_VAConfigAttribValEncJPEG>() - 4usize];
    ["Alignment of _VAConfigAttribValEncJPEG"]
        [::std::mem::align_of::<_VAConfigAttribValEncJPEG>() - 4usize];
    ["Offset of field: _VAConfigAttribValEncJPEG::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValEncJPEG, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValEncJPEG::value"]
        [::std::mem::offset_of!(_VAConfigAttribValEncJPEG, value) - 0usize];
};
pub type VAConfigAttribValEncJPEG = _VAConfigAttribValEncJPEG;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValEncROI {
    pub bits: _VAConfigAttribValEncROI__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValEncROI__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncROI__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValEncROI__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValEncROI__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValEncROI__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValEncROI__bindgen_ty_1 {
    #[inline]
    pub fn num_roi_regions(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_num_roi_regions(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn roi_rc_priority_support(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_rc_priority_support(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn roi_rc_qp_delta_support(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_rc_qp_delta_support(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 22u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 22u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        num_roi_regions: u32,
        roi_rc_priority_support: u32,
        roi_rc_qp_delta_support: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let num_roi_regions: u32 = unsafe { ::std::mem::transmute(num_roi_regions) };
            num_roi_regions as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let roi_rc_priority_support: u32 =
                unsafe { ::std::mem::transmute(roi_rc_priority_support) };
            roi_rc_priority_support as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let roi_rc_qp_delta_support: u32 =
                unsafe { ::std::mem::transmute(roi_rc_qp_delta_support) };
            roi_rc_qp_delta_support as u64
        });
        __bindgen_bitfield_unit.set(10usize, 22u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncROI"]
        [::std::mem::size_of::<_VAConfigAttribValEncROI>() - 4usize];
    ["Alignment of _VAConfigAttribValEncROI"]
        [::std::mem::align_of::<_VAConfigAttribValEncROI>() - 4usize];
    ["Offset of field: _VAConfigAttribValEncROI::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValEncROI, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValEncROI::value"]
        [::std::mem::offset_of!(_VAConfigAttribValEncROI, value) - 0usize];
};
pub type VAConfigAttribValEncROI = _VAConfigAttribValEncROI;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValEncRateControlExt {
    pub bits: _VAConfigAttribValEncRateControlExt__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValEncRateControlExt__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncRateControlExt__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValEncRateControlExt__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValEncRateControlExt__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValEncRateControlExt__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValEncRateControlExt__bindgen_ty_1 {
    #[inline]
    pub fn max_num_temporal_layers_minus1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_temporal_layers_minus1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn temporal_layer_bitrate_control_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temporal_layer_bitrate_control_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        max_num_temporal_layers_minus1: u32,
        temporal_layer_bitrate_control_flag: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let max_num_temporal_layers_minus1: u32 =
                unsafe { ::std::mem::transmute(max_num_temporal_layers_minus1) };
            max_num_temporal_layers_minus1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let temporal_layer_bitrate_control_flag: u32 =
                unsafe { ::std::mem::transmute(temporal_layer_bitrate_control_flag) };
            temporal_layer_bitrate_control_flag as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncRateControlExt"]
        [::std::mem::size_of::<_VAConfigAttribValEncRateControlExt>() - 4usize];
    ["Alignment of _VAConfigAttribValEncRateControlExt"]
        [::std::mem::align_of::<_VAConfigAttribValEncRateControlExt>() - 4usize];
    ["Offset of field: _VAConfigAttribValEncRateControlExt::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValEncRateControlExt, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValEncRateControlExt::value"]
        [::std::mem::offset_of!(_VAConfigAttribValEncRateControlExt, value) - 0usize];
};
pub type VAConfigAttribValEncRateControlExt = _VAConfigAttribValEncRateControlExt;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValMultipleFrame {
    pub bits: _VAConfigAttribValMultipleFrame__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValMultipleFrame__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValMultipleFrame__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValMultipleFrame__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValMultipleFrame__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValMultipleFrame__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValMultipleFrame__bindgen_ty_1 {
    #[inline]
    pub fn max_num_concurrent_frames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_concurrent_frames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn mixed_quality_level(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mixed_quality_level(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        max_num_concurrent_frames: u32,
        mixed_quality_level: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let max_num_concurrent_frames: u32 =
                unsafe { ::std::mem::transmute(max_num_concurrent_frames) };
            max_num_concurrent_frames as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let mixed_quality_level: u32 = unsafe { ::std::mem::transmute(mixed_quality_level) };
            mixed_quality_level as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValMultipleFrame"]
        [::std::mem::size_of::<_VAConfigAttribValMultipleFrame>() - 4usize];
    ["Alignment of _VAConfigAttribValMultipleFrame"]
        [::std::mem::align_of::<_VAConfigAttribValMultipleFrame>() - 4usize];
    ["Offset of field: _VAConfigAttribValMultipleFrame::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValMultipleFrame, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValMultipleFrame::value"]
        [::std::mem::offset_of!(_VAConfigAttribValMultipleFrame, value) - 0usize];
};
pub type VAConfigAttribValMultipleFrame = _VAConfigAttribValMultipleFrame;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValContextPriority {
    pub bits: _VAConfigAttribValContextPriority__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValContextPriority__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValContextPriority__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValContextPriority__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValContextPriority__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValContextPriority__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValContextPriority__bindgen_ty_1 {
    #[inline]
    pub fn priority(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_priority(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(priority: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let priority: u32 = unsafe { ::std::mem::transmute(priority) };
            priority as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValContextPriority"]
        [::std::mem::size_of::<_VAConfigAttribValContextPriority>() - 4usize];
    ["Alignment of _VAConfigAttribValContextPriority"]
        [::std::mem::align_of::<_VAConfigAttribValContextPriority>() - 4usize];
    ["Offset of field: _VAConfigAttribValContextPriority::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValContextPriority, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValContextPriority::value"]
        [::std::mem::offset_of!(_VAConfigAttribValContextPriority, value) - 0usize];
};
pub type VAConfigAttribValContextPriority = _VAConfigAttribValContextPriority;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValEncPerBlockControl {
    pub bits: _VAConfigAttribValEncPerBlockControl__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValEncPerBlockControl__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncPerBlockControl__bindgen_ty_1"]
        [::std::mem::size_of::<_VAConfigAttribValEncPerBlockControl__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAConfigAttribValEncPerBlockControl__bindgen_ty_1"]
        [::std::mem::align_of::<_VAConfigAttribValEncPerBlockControl__bindgen_ty_1>() - 4usize];
};
impl _VAConfigAttribValEncPerBlockControl__bindgen_ty_1 {
    #[inline]
    pub fn delta_qp_support(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_delta_qp_support(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn log2_delta_qp_block_size(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_log2_delta_qp_block_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn delta_qp_size_in_bytes(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_delta_qp_size_in_bytes(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        delta_qp_support: u32,
        log2_delta_qp_block_size: u32,
        delta_qp_size_in_bytes: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let delta_qp_support: u32 = unsafe { ::std::mem::transmute(delta_qp_support) };
            delta_qp_support as u64
        });
        __bindgen_bitfield_unit.set(1usize, 4u8, {
            let log2_delta_qp_block_size: u32 =
                unsafe { ::std::mem::transmute(log2_delta_qp_block_size) };
            log2_delta_qp_block_size as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let delta_qp_size_in_bytes: u32 =
                unsafe { ::std::mem::transmute(delta_qp_size_in_bytes) };
            delta_qp_size_in_bytes as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAConfigAttribValEncPerBlockControl"]
        [::std::mem::size_of::<_VAConfigAttribValEncPerBlockControl>() - 4usize];
    ["Alignment of _VAConfigAttribValEncPerBlockControl"]
        [::std::mem::align_of::<_VAConfigAttribValEncPerBlockControl>() - 4usize];
    ["Offset of field: _VAConfigAttribValEncPerBlockControl::bits"]
        [::std::mem::offset_of!(_VAConfigAttribValEncPerBlockControl, bits) - 0usize];
    ["Offset of field: _VAConfigAttribValEncPerBlockControl::value"]
        [::std::mem::offset_of!(_VAConfigAttribValEncPerBlockControl, value) - 0usize];
};
pub type VAConfigAttribValEncPerBlockControl = _VAConfigAttribValEncPerBlockControl;
pub type VAGenericID = ::std::os::raw::c_uint;
pub type VAConfigID = VAGenericID;
pub type VAContextID = VAGenericID;
pub type VASurfaceID = VAGenericID;
pub const VAGenericValueTypeInteger: VAGenericValueType = 1;
pub const VAGenericValueTypeFloat: VAGenericValueType = 2;
pub const VAGenericValueTypePointer: VAGenericValueType = 3;
pub const VAGenericValueTypeFunc: VAGenericValueType = 4;
pub type VAGenericValueType = ::std::os::raw::c_uint;
pub type VAGenericFunc = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAGenericValue {
    pub type_: VAGenericValueType,
    pub value: _VAGenericValue__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAGenericValue__bindgen_ty_1 {
    pub i: i32,
    pub f: f32,
    pub p: *mut ::std::os::raw::c_void,
    pub fn_: VAGenericFunc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAGenericValue__bindgen_ty_1"]
        [::std::mem::size_of::<_VAGenericValue__bindgen_ty_1>() - 8usize];
    ["Alignment of _VAGenericValue__bindgen_ty_1"]
        [::std::mem::align_of::<_VAGenericValue__bindgen_ty_1>() - 8usize];
    ["Offset of field: _VAGenericValue__bindgen_ty_1::i"]
        [::std::mem::offset_of!(_VAGenericValue__bindgen_ty_1, i) - 0usize];
    ["Offset of field: _VAGenericValue__bindgen_ty_1::f"]
        [::std::mem::offset_of!(_VAGenericValue__bindgen_ty_1, f) - 0usize];
    ["Offset of field: _VAGenericValue__bindgen_ty_1::p"]
        [::std::mem::offset_of!(_VAGenericValue__bindgen_ty_1, p) - 0usize];
    ["Offset of field: _VAGenericValue__bindgen_ty_1::fn_"]
        [::std::mem::offset_of!(_VAGenericValue__bindgen_ty_1, fn_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAGenericValue"][::std::mem::size_of::<_VAGenericValue>() - 16usize];
    ["Alignment of _VAGenericValue"][::std::mem::align_of::<_VAGenericValue>() - 8usize];
    ["Offset of field: _VAGenericValue::type_"]
        [::std::mem::offset_of!(_VAGenericValue, type_) - 0usize];
    ["Offset of field: _VAGenericValue::value"]
        [::std::mem::offset_of!(_VAGenericValue, value) - 8usize];
};
pub type VAGenericValue = _VAGenericValue;
pub const VASurfaceAttribNone: VASurfaceAttribType = 0;
pub const VASurfaceAttribPixelFormat: VASurfaceAttribType = 1;
pub const VASurfaceAttribMinWidth: VASurfaceAttribType = 2;
pub const VASurfaceAttribMaxWidth: VASurfaceAttribType = 3;
pub const VASurfaceAttribMinHeight: VASurfaceAttribType = 4;
pub const VASurfaceAttribMaxHeight: VASurfaceAttribType = 5;
pub const VASurfaceAttribMemoryType: VASurfaceAttribType = 6;
pub const VASurfaceAttribExternalBufferDescriptor: VASurfaceAttribType = 7;
pub const VASurfaceAttribUsageHint: VASurfaceAttribType = 8;
pub const VASurfaceAttribDRMFormatModifiers: VASurfaceAttribType = 9;
pub const VASurfaceAttribAlignmentSize: VASurfaceAttribType = 10;
pub const VASurfaceAttribCount: VASurfaceAttribType = 11;
pub type VASurfaceAttribType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VASurfaceAttrib {
    pub type_: VASurfaceAttribType,
    pub flags: u32,
    pub value: VAGenericValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASurfaceAttrib"][::std::mem::size_of::<_VASurfaceAttrib>() - 24usize];
    ["Alignment of _VASurfaceAttrib"][::std::mem::align_of::<_VASurfaceAttrib>() - 8usize];
    ["Offset of field: _VASurfaceAttrib::type_"]
        [::std::mem::offset_of!(_VASurfaceAttrib, type_) - 0usize];
    ["Offset of field: _VASurfaceAttrib::flags"]
        [::std::mem::offset_of!(_VASurfaceAttrib, flags) - 4usize];
    ["Offset of field: _VASurfaceAttrib::value"]
        [::std::mem::offset_of!(_VASurfaceAttrib, value) - 8usize];
};
pub type VASurfaceAttrib = _VASurfaceAttrib;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VASurfaceAttribAlignmentStruct {
    pub bits: _VASurfaceAttribAlignmentStruct__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASurfaceAttribAlignmentStruct__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASurfaceAttribAlignmentStruct__bindgen_ty_1"]
        [::std::mem::size_of::<_VASurfaceAttribAlignmentStruct__bindgen_ty_1>() - 4usize];
    ["Alignment of _VASurfaceAttribAlignmentStruct__bindgen_ty_1"]
        [::std::mem::align_of::<_VASurfaceAttribAlignmentStruct__bindgen_ty_1>() - 4usize];
};
impl _VASurfaceAttribAlignmentStruct__bindgen_ty_1 {
    #[inline]
    pub fn log2_width_alignment(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_log2_width_alignment(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn log2_height_alignment(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_log2_height_alignment(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        log2_width_alignment: u32,
        log2_height_alignment: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let log2_width_alignment: u32 = unsafe { ::std::mem::transmute(log2_width_alignment) };
            log2_width_alignment as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let log2_height_alignment: u32 =
                unsafe { ::std::mem::transmute(log2_height_alignment) };
            log2_height_alignment as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASurfaceAttribAlignmentStruct"]
        [::std::mem::size_of::<_VASurfaceAttribAlignmentStruct>() - 4usize];
    ["Alignment of _VASurfaceAttribAlignmentStruct"]
        [::std::mem::align_of::<_VASurfaceAttribAlignmentStruct>() - 4usize];
    ["Offset of field: _VASurfaceAttribAlignmentStruct::bits"]
        [::std::mem::offset_of!(_VASurfaceAttribAlignmentStruct, bits) - 0usize];
    ["Offset of field: _VASurfaceAttribAlignmentStruct::value"]
        [::std::mem::offset_of!(_VASurfaceAttribAlignmentStruct, value) - 0usize];
};
pub type VASurfaceAttribAlignmentStruct = _VASurfaceAttribAlignmentStruct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASurfaceAttribExternalBuffers {
    pub pixel_format: u32,
    pub width: u32,
    pub height: u32,
    pub data_size: u32,
    pub num_planes: u32,
    pub pitches: [u32; 4usize],
    pub offsets: [u32; 4usize],
    pub buffers: *mut usize,
    pub num_buffers: u32,
    pub flags: u32,
    pub private_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASurfaceAttribExternalBuffers"]
        [::std::mem::size_of::<_VASurfaceAttribExternalBuffers>() - 80usize];
    ["Alignment of _VASurfaceAttribExternalBuffers"]
        [::std::mem::align_of::<_VASurfaceAttribExternalBuffers>() - 8usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::pixel_format"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, pixel_format) - 0usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::width"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, width) - 4usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::height"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, height) - 8usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::data_size"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, data_size) - 12usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::num_planes"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, num_planes) - 16usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::pitches"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, pitches) - 20usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::offsets"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, offsets) - 36usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::buffers"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, buffers) - 56usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::num_buffers"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, num_buffers) - 64usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::flags"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, flags) - 68usize];
    ["Offset of field: _VASurfaceAttribExternalBuffers::private_data"]
        [::std::mem::offset_of!(_VASurfaceAttribExternalBuffers, private_data) - 72usize];
};
pub type VASurfaceAttribExternalBuffers = _VASurfaceAttribExternalBuffers;
pub type VAMFContextID = VAGenericID;
pub type VABufferID = VAGenericID;
pub const VAPictureParameterBufferType: VABufferType = 0;
pub const VAIQMatrixBufferType: VABufferType = 1;
pub const VABitPlaneBufferType: VABufferType = 2;
pub const VASliceGroupMapBufferType: VABufferType = 3;
pub const VASliceParameterBufferType: VABufferType = 4;
pub const VASliceDataBufferType: VABufferType = 5;
pub const VAMacroblockParameterBufferType: VABufferType = 6;
pub const VAResidualDataBufferType: VABufferType = 7;
pub const VADeblockingParameterBufferType: VABufferType = 8;
pub const VAImageBufferType: VABufferType = 9;
pub const VAProtectedSliceDataBufferType: VABufferType = 10;
pub const VAQMatrixBufferType: VABufferType = 11;
pub const VAHuffmanTableBufferType: VABufferType = 12;
pub const VAProbabilityBufferType: VABufferType = 13;
pub const VAEncCodedBufferType: VABufferType = 21;
pub const VAEncSequenceParameterBufferType: VABufferType = 22;
pub const VAEncPictureParameterBufferType: VABufferType = 23;
pub const VAEncSliceParameterBufferType: VABufferType = 24;
pub const VAEncPackedHeaderParameterBufferType: VABufferType = 25;
pub const VAEncPackedHeaderDataBufferType: VABufferType = 26;
pub const VAEncMiscParameterBufferType: VABufferType = 27;
pub const VAEncMacroblockParameterBufferType: VABufferType = 28;
pub const VAEncMacroblockMapBufferType: VABufferType = 29;
pub const VAEncQPBufferType: VABufferType = 30;
pub const VAProcPipelineParameterBufferType: VABufferType = 41;
pub const VAProcFilterParameterBufferType: VABufferType = 42;
pub const VAEncFEIMVBufferType: VABufferType = 43;
pub const VAEncFEIMBCodeBufferType: VABufferType = 44;
pub const VAEncFEIDistortionBufferType: VABufferType = 45;
pub const VAEncFEIMBControlBufferType: VABufferType = 46;
pub const VAEncFEIMVPredictorBufferType: VABufferType = 47;
pub const VAStatsStatisticsParameterBufferType: VABufferType = 48;
pub const VAStatsStatisticsBufferType: VABufferType = 49;
pub const VAStatsStatisticsBottomFieldBufferType: VABufferType = 50;
pub const VAStatsMVBufferType: VABufferType = 51;
pub const VAStatsMVPredictorBufferType: VABufferType = 52;
pub const VAEncMacroblockDisableSkipMapBufferType: VABufferType = 53;
pub const VAEncFEICTBCmdBufferType: VABufferType = 54;
pub const VAEncFEICURecordBufferType: VABufferType = 55;
pub const VADecodeStreamoutBufferType: VABufferType = 56;
pub const VASubsetsParameterBufferType: VABufferType = 57;
pub const VAContextParameterUpdateBufferType: VABufferType = 58;
pub const VAProtectedSessionExecuteBufferType: VABufferType = 59;
pub const VAEncryptionParameterBufferType: VABufferType = 60;
pub const VAEncDeltaQpPerBlockBufferType: VABufferType = 61;
pub const VAAlfBufferType: VABufferType = 62;
pub const VALmcsBufferType: VABufferType = 63;
pub const VASubPicBufferType: VABufferType = 64;
pub const VATileBufferType: VABufferType = 65;
pub const VASliceStructBufferType: VABufferType = 66;
pub const VABufferTypeMax: VABufferType = 67;
pub type VABufferType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAContextParameterUpdateBuffer {
    pub flags: _VAContextParameterUpdateBuffer__bindgen_ty_1,
    pub context_priority: VAConfigAttribValContextPriority,
    pub reserved: [u32; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAContextParameterUpdateBuffer__bindgen_ty_1 {
    pub bits: _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1>()
            - 4usize];
};
impl _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn context_priority_update(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_context_priority_update(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        context_priority_update: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let context_priority_update: u32 =
                unsafe { ::std::mem::transmute(context_priority_update) };
            context_priority_update as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAContextParameterUpdateBuffer__bindgen_ty_1"]
        [::std::mem::size_of::<_VAContextParameterUpdateBuffer__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAContextParameterUpdateBuffer__bindgen_ty_1"]
        [::std::mem::align_of::<_VAContextParameterUpdateBuffer__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAContextParameterUpdateBuffer__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAContextParameterUpdateBuffer__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAContextParameterUpdateBuffer__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAContextParameterUpdateBuffer__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAContextParameterUpdateBuffer"]
        [::std::mem::size_of::<_VAContextParameterUpdateBuffer>() - 40usize];
    ["Alignment of _VAContextParameterUpdateBuffer"]
        [::std::mem::align_of::<_VAContextParameterUpdateBuffer>() - 4usize];
    ["Offset of field: _VAContextParameterUpdateBuffer::flags"]
        [::std::mem::offset_of!(_VAContextParameterUpdateBuffer, flags) - 0usize];
    ["Offset of field: _VAContextParameterUpdateBuffer::context_priority"]
        [::std::mem::offset_of!(_VAContextParameterUpdateBuffer, context_priority) - 4usize];
    ["Offset of field: _VAContextParameterUpdateBuffer::reserved"]
        [::std::mem::offset_of!(_VAContextParameterUpdateBuffer, reserved) - 8usize];
};
pub type VAContextParameterUpdateBuffer = _VAContextParameterUpdateBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncryptionSegmentInfo {
    pub segment_start_offset: u32,
    pub segment_length: u32,
    pub partial_aes_block_size: u32,
    pub init_byte_length: u32,
    pub aes_cbc_iv_or_ctr: [u8; 64usize],
    pub va_reserved: [u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncryptionSegmentInfo"]
        [::std::mem::size_of::<_VAEncryptionSegmentInfo>() - 112usize];
    ["Alignment of _VAEncryptionSegmentInfo"]
        [::std::mem::align_of::<_VAEncryptionSegmentInfo>() - 4usize];
    ["Offset of field: _VAEncryptionSegmentInfo::segment_start_offset"]
        [::std::mem::offset_of!(_VAEncryptionSegmentInfo, segment_start_offset) - 0usize];
    ["Offset of field: _VAEncryptionSegmentInfo::segment_length"]
        [::std::mem::offset_of!(_VAEncryptionSegmentInfo, segment_length) - 4usize];
    ["Offset of field: _VAEncryptionSegmentInfo::partial_aes_block_size"]
        [::std::mem::offset_of!(_VAEncryptionSegmentInfo, partial_aes_block_size) - 8usize];
    ["Offset of field: _VAEncryptionSegmentInfo::init_byte_length"]
        [::std::mem::offset_of!(_VAEncryptionSegmentInfo, init_byte_length) - 12usize];
    ["Offset of field: _VAEncryptionSegmentInfo::aes_cbc_iv_or_ctr"]
        [::std::mem::offset_of!(_VAEncryptionSegmentInfo, aes_cbc_iv_or_ctr) - 16usize];
    ["Offset of field: _VAEncryptionSegmentInfo::va_reserved"]
        [::std::mem::offset_of!(_VAEncryptionSegmentInfo, va_reserved) - 80usize];
};
pub type VAEncryptionSegmentInfo = _VAEncryptionSegmentInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncryptionParameters {
    pub encryption_type: u32,
    pub num_segments: u32,
    pub segment_info: *mut VAEncryptionSegmentInfo,
    pub status_report_index: u32,
    pub size_of_length: u32,
    pub wrapped_decrypt_blob: [u8; 64usize],
    pub wrapped_encrypt_blob: [u8; 64usize],
    pub key_blob_size: u32,
    pub blocks_stripe_encrypted: u32,
    pub blocks_stripe_clear: u32,
    pub va_reserved: [u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncryptionParameters"]
        [::std::mem::size_of::<_VAEncryptionParameters>() - 200usize];
    ["Alignment of _VAEncryptionParameters"]
        [::std::mem::align_of::<_VAEncryptionParameters>() - 8usize];
    ["Offset of field: _VAEncryptionParameters::encryption_type"]
        [::std::mem::offset_of!(_VAEncryptionParameters, encryption_type) - 0usize];
    ["Offset of field: _VAEncryptionParameters::num_segments"]
        [::std::mem::offset_of!(_VAEncryptionParameters, num_segments) - 4usize];
    ["Offset of field: _VAEncryptionParameters::segment_info"]
        [::std::mem::offset_of!(_VAEncryptionParameters, segment_info) - 8usize];
    ["Offset of field: _VAEncryptionParameters::status_report_index"]
        [::std::mem::offset_of!(_VAEncryptionParameters, status_report_index) - 16usize];
    ["Offset of field: _VAEncryptionParameters::size_of_length"]
        [::std::mem::offset_of!(_VAEncryptionParameters, size_of_length) - 20usize];
    ["Offset of field: _VAEncryptionParameters::wrapped_decrypt_blob"]
        [::std::mem::offset_of!(_VAEncryptionParameters, wrapped_decrypt_blob) - 24usize];
    ["Offset of field: _VAEncryptionParameters::wrapped_encrypt_blob"]
        [::std::mem::offset_of!(_VAEncryptionParameters, wrapped_encrypt_blob) - 88usize];
    ["Offset of field: _VAEncryptionParameters::key_blob_size"]
        [::std::mem::offset_of!(_VAEncryptionParameters, key_blob_size) - 152usize];
    ["Offset of field: _VAEncryptionParameters::blocks_stripe_encrypted"]
        [::std::mem::offset_of!(_VAEncryptionParameters, blocks_stripe_encrypted) - 156usize];
    ["Offset of field: _VAEncryptionParameters::blocks_stripe_clear"]
        [::std::mem::offset_of!(_VAEncryptionParameters, blocks_stripe_clear) - 160usize];
    ["Offset of field: _VAEncryptionParameters::va_reserved"]
        [::std::mem::offset_of!(_VAEncryptionParameters, va_reserved) - 164usize];
};
pub type VAEncryptionParameters = _VAEncryptionParameters;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAProcessingRateParameterEnc {
    pub level_idc: u8,
    pub reserved: [u8; 3usize],
    pub quality_level: u32,
    pub intra_period: u32,
    pub ip_period: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAProcessingRateParameterEnc"]
        [::std::mem::size_of::<_VAProcessingRateParameterEnc>() - 16usize];
    ["Alignment of _VAProcessingRateParameterEnc"]
        [::std::mem::align_of::<_VAProcessingRateParameterEnc>() - 4usize];
    ["Offset of field: _VAProcessingRateParameterEnc::level_idc"]
        [::std::mem::offset_of!(_VAProcessingRateParameterEnc, level_idc) - 0usize];
    ["Offset of field: _VAProcessingRateParameterEnc::reserved"]
        [::std::mem::offset_of!(_VAProcessingRateParameterEnc, reserved) - 1usize];
    ["Offset of field: _VAProcessingRateParameterEnc::quality_level"]
        [::std::mem::offset_of!(_VAProcessingRateParameterEnc, quality_level) - 4usize];
    ["Offset of field: _VAProcessingRateParameterEnc::intra_period"]
        [::std::mem::offset_of!(_VAProcessingRateParameterEnc, intra_period) - 8usize];
    ["Offset of field: _VAProcessingRateParameterEnc::ip_period"]
        [::std::mem::offset_of!(_VAProcessingRateParameterEnc, ip_period) - 12usize];
};
pub type VAProcessingRateParameterEnc = _VAProcessingRateParameterEnc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAProcessingRateParameterDec {
    pub level_idc: u8,
    pub reserved0: [u8; 3usize],
    pub reserved: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAProcessingRateParameterDec"]
        [::std::mem::size_of::<_VAProcessingRateParameterDec>() - 8usize];
    ["Alignment of _VAProcessingRateParameterDec"]
        [::std::mem::align_of::<_VAProcessingRateParameterDec>() - 4usize];
    ["Offset of field: _VAProcessingRateParameterDec::level_idc"]
        [::std::mem::offset_of!(_VAProcessingRateParameterDec, level_idc) - 0usize];
    ["Offset of field: _VAProcessingRateParameterDec::reserved0"]
        [::std::mem::offset_of!(_VAProcessingRateParameterDec, reserved0) - 1usize];
    ["Offset of field: _VAProcessingRateParameterDec::reserved"]
        [::std::mem::offset_of!(_VAProcessingRateParameterDec, reserved) - 4usize];
};
pub type VAProcessingRateParameterDec = _VAProcessingRateParameterDec;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAProcessingRateParameter {
    pub __bindgen_anon_1: _VAProcessingRateParameter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAProcessingRateParameter__bindgen_ty_1 {
    pub proc_buf_enc: VAProcessingRateParameterEnc,
    pub proc_buf_dec: VAProcessingRateParameterDec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAProcessingRateParameter__bindgen_ty_1"]
        [::std::mem::size_of::<_VAProcessingRateParameter__bindgen_ty_1>() - 16usize];
    ["Alignment of _VAProcessingRateParameter__bindgen_ty_1"]
        [::std::mem::align_of::<_VAProcessingRateParameter__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAProcessingRateParameter__bindgen_ty_1::proc_buf_enc"]
        [::std::mem::offset_of!(_VAProcessingRateParameter__bindgen_ty_1, proc_buf_enc) - 0usize];
    ["Offset of field: _VAProcessingRateParameter__bindgen_ty_1::proc_buf_dec"]
        [::std::mem::offset_of!(_VAProcessingRateParameter__bindgen_ty_1, proc_buf_dec) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAProcessingRateParameter"]
        [::std::mem::size_of::<_VAProcessingRateParameter>() - 16usize];
    ["Alignment of _VAProcessingRateParameter"]
        [::std::mem::align_of::<_VAProcessingRateParameter>() - 4usize];
};
pub type VAProcessingRateParameter = _VAProcessingRateParameter;
pub const VAEncMiscParameterTypeFrameRate: VAEncMiscParameterType = 0;
pub const VAEncMiscParameterTypeRateControl: VAEncMiscParameterType = 1;
pub const VAEncMiscParameterTypeMaxSliceSize: VAEncMiscParameterType = 2;
pub const VAEncMiscParameterTypeAIR: VAEncMiscParameterType = 3;
pub const VAEncMiscParameterTypeMaxFrameSize: VAEncMiscParameterType = 4;
pub const VAEncMiscParameterTypeHRD: VAEncMiscParameterType = 5;
pub const VAEncMiscParameterTypeQualityLevel: VAEncMiscParameterType = 6;
pub const VAEncMiscParameterTypeRIR: VAEncMiscParameterType = 7;
pub const VAEncMiscParameterTypeQuantization: VAEncMiscParameterType = 8;
pub const VAEncMiscParameterTypeSkipFrame: VAEncMiscParameterType = 9;
pub const VAEncMiscParameterTypeROI: VAEncMiscParameterType = 10;
pub const VAEncMiscParameterTypeMultiPassFrameSize: VAEncMiscParameterType = 11;
pub const VAEncMiscParameterTypeTemporalLayerStructure: VAEncMiscParameterType = 12;
pub const VAEncMiscParameterTypeDirtyRect: VAEncMiscParameterType = 13;
pub const VAEncMiscParameterTypeParallelBRC: VAEncMiscParameterType = 14;
pub const VAEncMiscParameterTypeSubMbPartPel: VAEncMiscParameterType = 15;
pub const VAEncMiscParameterTypeEncQuality: VAEncMiscParameterType = 16;
pub const VAEncMiscParameterTypeCustomRoundingControl: VAEncMiscParameterType = 17;
pub const VAEncMiscParameterTypeFEIFrameControl: VAEncMiscParameterType = 18;
pub const VAEncMiscParameterTypeExtensionData: VAEncMiscParameterType = 19;
pub type VAEncMiscParameterType = ::std::os::raw::c_uint;
pub const VAEncPackedHeaderSequence: VAEncPackedHeaderType = 1;
pub const VAEncPackedHeaderPicture: VAEncPackedHeaderType = 2;
pub const VAEncPackedHeaderSlice: VAEncPackedHeaderType = 3;
pub const VAEncPackedHeaderRawData: VAEncPackedHeaderType = 4;
pub const VAEncPackedHeaderMiscMask: VAEncPackedHeaderType = 2147483648;
pub type VAEncPackedHeaderType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncPackedHeaderParameterBuffer {
    pub type_: u32,
    pub bit_length: u32,
    pub has_emulation_bytes: u8,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncPackedHeaderParameterBuffer"]
        [::std::mem::size_of::<_VAEncPackedHeaderParameterBuffer>() - 28usize];
    ["Alignment of _VAEncPackedHeaderParameterBuffer"]
        [::std::mem::align_of::<_VAEncPackedHeaderParameterBuffer>() - 4usize];
    ["Offset of field: _VAEncPackedHeaderParameterBuffer::type_"]
        [::std::mem::offset_of!(_VAEncPackedHeaderParameterBuffer, type_) - 0usize];
    ["Offset of field: _VAEncPackedHeaderParameterBuffer::bit_length"]
        [::std::mem::offset_of!(_VAEncPackedHeaderParameterBuffer, bit_length) - 4usize];
    ["Offset of field: _VAEncPackedHeaderParameterBuffer::has_emulation_bytes"]
        [::std::mem::offset_of!(_VAEncPackedHeaderParameterBuffer, has_emulation_bytes) - 8usize];
    ["Offset of field: _VAEncPackedHeaderParameterBuffer::va_reserved"]
        [::std::mem::offset_of!(_VAEncPackedHeaderParameterBuffer, va_reserved) - 12usize];
};
pub type VAEncPackedHeaderParameterBuffer = _VAEncPackedHeaderParameterBuffer;
#[repr(C)]
#[derive(Debug)]
pub struct _VAEncMiscParameterBuffer {
    pub type_: VAEncMiscParameterType,
    pub data: __IncompleteArrayField<u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBuffer"]
        [::std::mem::size_of::<_VAEncMiscParameterBuffer>() - 4usize];
    ["Alignment of _VAEncMiscParameterBuffer"]
        [::std::mem::align_of::<_VAEncMiscParameterBuffer>() - 4usize];
    ["Offset of field: _VAEncMiscParameterBuffer::type_"]
        [::std::mem::offset_of!(_VAEncMiscParameterBuffer, type_) - 0usize];
    ["Offset of field: _VAEncMiscParameterBuffer::data"]
        [::std::mem::offset_of!(_VAEncMiscParameterBuffer, data) - 4usize];
};
pub type VAEncMiscParameterBuffer = _VAEncMiscParameterBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterTemporalLayerStructure {
    pub number_of_layers: u32,
    pub periodicity: u32,
    pub layer_id: [u32; 32usize],
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterTemporalLayerStructure"]
        [::std::mem::size_of::<_VAEncMiscParameterTemporalLayerStructure>() - 152usize];
    ["Alignment of _VAEncMiscParameterTemporalLayerStructure"]
        [::std::mem::align_of::<_VAEncMiscParameterTemporalLayerStructure>() - 4usize];
    ["Offset of field: _VAEncMiscParameterTemporalLayerStructure::number_of_layers"][::std::mem::offset_of!(
        _VAEncMiscParameterTemporalLayerStructure,
        number_of_layers
    ) - 0usize];
    ["Offset of field: _VAEncMiscParameterTemporalLayerStructure::periodicity"]
        [::std::mem::offset_of!(_VAEncMiscParameterTemporalLayerStructure, periodicity) - 4usize];
    ["Offset of field: _VAEncMiscParameterTemporalLayerStructure::layer_id"]
        [::std::mem::offset_of!(_VAEncMiscParameterTemporalLayerStructure, layer_id) - 8usize];
    ["Offset of field: _VAEncMiscParameterTemporalLayerStructure::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterTemporalLayerStructure, va_reserved) - 136usize];
};
pub type VAEncMiscParameterTemporalLayerStructure = _VAEncMiscParameterTemporalLayerStructure;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterRateControl {
    pub bits_per_second: u32,
    pub target_percentage: u32,
    pub window_size: u32,
    pub initial_qp: u32,
    pub min_qp: u32,
    pub basic_unit_size: u32,
    pub rc_flags: _VAEncMiscParameterRateControl__bindgen_ty_1,
    pub ICQ_quality_factor: u32,
    pub max_qp: u32,
    pub quality_factor: u32,
    pub target_frame_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterRateControl__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn reset(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reset(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disable_frame_skip(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disable_frame_skip(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disable_bit_stuffing(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disable_bit_stuffing(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mb_rate_control(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_mb_rate_control(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn temporal_id(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_temporal_id(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn cfs_I_frames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cfs_I_frames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_parallel_brc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_parallel_brc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_dynamic_scaling(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_dynamic_scaling(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_tolerance_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_frame_tolerance_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        reset: u32,
        disable_frame_skip: u32,
        disable_bit_stuffing: u32,
        mb_rate_control: u32,
        temporal_id: u32,
        cfs_I_frames: u32,
        enable_parallel_brc: u32,
        enable_dynamic_scaling: u32,
        frame_tolerance_mode: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let reset: u32 = unsafe { ::std::mem::transmute(reset) };
            reset as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let disable_frame_skip: u32 = unsafe { ::std::mem::transmute(disable_frame_skip) };
            disable_frame_skip as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let disable_bit_stuffing: u32 = unsafe { ::std::mem::transmute(disable_bit_stuffing) };
            disable_bit_stuffing as u64
        });
        __bindgen_bitfield_unit.set(3usize, 4u8, {
            let mb_rate_control: u32 = unsafe { ::std::mem::transmute(mb_rate_control) };
            mb_rate_control as u64
        });
        __bindgen_bitfield_unit.set(7usize, 8u8, {
            let temporal_id: u32 = unsafe { ::std::mem::transmute(temporal_id) };
            temporal_id as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let cfs_I_frames: u32 = unsafe { ::std::mem::transmute(cfs_I_frames) };
            cfs_I_frames as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let enable_parallel_brc: u32 = unsafe { ::std::mem::transmute(enable_parallel_brc) };
            enable_parallel_brc as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let enable_dynamic_scaling: u32 =
                unsafe { ::std::mem::transmute(enable_dynamic_scaling) };
            enable_dynamic_scaling as u64
        });
        __bindgen_bitfield_unit.set(18usize, 2u8, {
            let frame_tolerance_mode: u32 = unsafe { ::std::mem::transmute(frame_tolerance_mode) };
            frame_tolerance_mode as u64
        });
        __bindgen_bitfield_unit.set(20usize, 12u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterRateControl__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterRateControl__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterRateControl__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterRateControl__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncMiscParameterRateControl__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAEncMiscParameterRateControl__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterRateControl"]
        [::std::mem::size_of::<_VAEncMiscParameterRateControl>() - 60usize];
    ["Alignment of _VAEncMiscParameterRateControl"]
        [::std::mem::align_of::<_VAEncMiscParameterRateControl>() - 4usize];
    ["Offset of field: _VAEncMiscParameterRateControl::bits_per_second"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, bits_per_second) - 0usize];
    ["Offset of field: _VAEncMiscParameterRateControl::target_percentage"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, target_percentage) - 4usize];
    ["Offset of field: _VAEncMiscParameterRateControl::window_size"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, window_size) - 8usize];
    ["Offset of field: _VAEncMiscParameterRateControl::initial_qp"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, initial_qp) - 12usize];
    ["Offset of field: _VAEncMiscParameterRateControl::min_qp"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, min_qp) - 16usize];
    ["Offset of field: _VAEncMiscParameterRateControl::basic_unit_size"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, basic_unit_size) - 20usize];
    ["Offset of field: _VAEncMiscParameterRateControl::rc_flags"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, rc_flags) - 24usize];
    ["Offset of field: _VAEncMiscParameterRateControl::ICQ_quality_factor"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, ICQ_quality_factor) - 28usize];
    ["Offset of field: _VAEncMiscParameterRateControl::max_qp"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, max_qp) - 32usize];
    ["Offset of field: _VAEncMiscParameterRateControl::quality_factor"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, quality_factor) - 36usize];
    ["Offset of field: _VAEncMiscParameterRateControl::target_frame_size"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, target_frame_size) - 40usize];
    ["Offset of field: _VAEncMiscParameterRateControl::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterRateControl, va_reserved) - 44usize];
};
pub type VAEncMiscParameterRateControl = _VAEncMiscParameterRateControl;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterFrameRate {
    pub framerate: u32,
    pub framerate_flags: _VAEncMiscParameterFrameRate__bindgen_ty_1,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterFrameRate__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn temporal_id(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_temporal_id(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(temporal_id: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let temporal_id: u32 = unsafe { ::std::mem::transmute(temporal_id) };
            temporal_id as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterFrameRate__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterFrameRate__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterFrameRate__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterFrameRate__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncMiscParameterFrameRate__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAEncMiscParameterFrameRate__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAEncMiscParameterFrameRate__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAEncMiscParameterFrameRate__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterFrameRate"]
        [::std::mem::size_of::<_VAEncMiscParameterFrameRate>() - 24usize];
    ["Alignment of _VAEncMiscParameterFrameRate"]
        [::std::mem::align_of::<_VAEncMiscParameterFrameRate>() - 4usize];
    ["Offset of field: _VAEncMiscParameterFrameRate::framerate"]
        [::std::mem::offset_of!(_VAEncMiscParameterFrameRate, framerate) - 0usize];
    ["Offset of field: _VAEncMiscParameterFrameRate::framerate_flags"]
        [::std::mem::offset_of!(_VAEncMiscParameterFrameRate, framerate_flags) - 4usize];
    ["Offset of field: _VAEncMiscParameterFrameRate::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterFrameRate, va_reserved) - 8usize];
};
pub type VAEncMiscParameterFrameRate = _VAEncMiscParameterFrameRate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterMaxSliceSize {
    pub max_slice_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterMaxSliceSize"]
        [::std::mem::size_of::<_VAEncMiscParameterMaxSliceSize>() - 20usize];
    ["Alignment of _VAEncMiscParameterMaxSliceSize"]
        [::std::mem::align_of::<_VAEncMiscParameterMaxSliceSize>() - 4usize];
    ["Offset of field: _VAEncMiscParameterMaxSliceSize::max_slice_size"]
        [::std::mem::offset_of!(_VAEncMiscParameterMaxSliceSize, max_slice_size) - 0usize];
    ["Offset of field: _VAEncMiscParameterMaxSliceSize::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterMaxSliceSize, va_reserved) - 4usize];
};
pub type VAEncMiscParameterMaxSliceSize = _VAEncMiscParameterMaxSliceSize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterAIR {
    pub air_num_mbs: u32,
    pub air_threshold: u32,
    pub air_auto: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterAIR"][::std::mem::size_of::<_VAEncMiscParameterAIR>() - 28usize];
    ["Alignment of _VAEncMiscParameterAIR"]
        [::std::mem::align_of::<_VAEncMiscParameterAIR>() - 4usize];
    ["Offset of field: _VAEncMiscParameterAIR::air_num_mbs"]
        [::std::mem::offset_of!(_VAEncMiscParameterAIR, air_num_mbs) - 0usize];
    ["Offset of field: _VAEncMiscParameterAIR::air_threshold"]
        [::std::mem::offset_of!(_VAEncMiscParameterAIR, air_threshold) - 4usize];
    ["Offset of field: _VAEncMiscParameterAIR::air_auto"]
        [::std::mem::offset_of!(_VAEncMiscParameterAIR, air_auto) - 8usize];
    ["Offset of field: _VAEncMiscParameterAIR::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterAIR, va_reserved) - 12usize];
};
pub type VAEncMiscParameterAIR = _VAEncMiscParameterAIR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterRIR {
    pub rir_flags: _VAEncMiscParameterRIR__bindgen_ty_1,
    pub intra_insertion_location: u16,
    pub intra_insert_size: u16,
    pub qp_delta_for_inserted_intra: u8,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterRIR__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1>() - 4usize];
};
impl _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn enable_rir_column(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_rir_column(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_rir_row(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_rir_row(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        enable_rir_column: u32,
        enable_rir_row: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enable_rir_column: u32 = unsafe { ::std::mem::transmute(enable_rir_column) };
            enable_rir_column as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enable_rir_row: u32 = unsafe { ::std::mem::transmute(enable_rir_row) };
            enable_rir_row as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterRIR__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterRIR__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterRIR__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterRIR__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncMiscParameterRIR__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAEncMiscParameterRIR__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAEncMiscParameterRIR__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAEncMiscParameterRIR__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterRIR"][::std::mem::size_of::<_VAEncMiscParameterRIR>() - 28usize];
    ["Alignment of _VAEncMiscParameterRIR"]
        [::std::mem::align_of::<_VAEncMiscParameterRIR>() - 4usize];
    ["Offset of field: _VAEncMiscParameterRIR::rir_flags"]
        [::std::mem::offset_of!(_VAEncMiscParameterRIR, rir_flags) - 0usize];
    ["Offset of field: _VAEncMiscParameterRIR::intra_insertion_location"]
        [::std::mem::offset_of!(_VAEncMiscParameterRIR, intra_insertion_location) - 4usize];
    ["Offset of field: _VAEncMiscParameterRIR::intra_insert_size"]
        [::std::mem::offset_of!(_VAEncMiscParameterRIR, intra_insert_size) - 6usize];
    ["Offset of field: _VAEncMiscParameterRIR::qp_delta_for_inserted_intra"]
        [::std::mem::offset_of!(_VAEncMiscParameterRIR, qp_delta_for_inserted_intra) - 8usize];
    ["Offset of field: _VAEncMiscParameterRIR::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterRIR, va_reserved) - 12usize];
};
pub type VAEncMiscParameterRIR = _VAEncMiscParameterRIR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterHRD {
    pub initial_buffer_fullness: u32,
    pub buffer_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterHRD"][::std::mem::size_of::<_VAEncMiscParameterHRD>() - 24usize];
    ["Alignment of _VAEncMiscParameterHRD"]
        [::std::mem::align_of::<_VAEncMiscParameterHRD>() - 4usize];
    ["Offset of field: _VAEncMiscParameterHRD::initial_buffer_fullness"]
        [::std::mem::offset_of!(_VAEncMiscParameterHRD, initial_buffer_fullness) - 0usize];
    ["Offset of field: _VAEncMiscParameterHRD::buffer_size"]
        [::std::mem::offset_of!(_VAEncMiscParameterHRD, buffer_size) - 4usize];
    ["Offset of field: _VAEncMiscParameterHRD::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterHRD, va_reserved) - 8usize];
};
pub type VAEncMiscParameterHRD = _VAEncMiscParameterHRD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferMaxFrameSize {
    pub type_: VAEncMiscParameterType,
    pub max_frame_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBufferMaxFrameSize"]
        [::std::mem::size_of::<_VAEncMiscParameterBufferMaxFrameSize>() - 24usize];
    ["Alignment of _VAEncMiscParameterBufferMaxFrameSize"]
        [::std::mem::align_of::<_VAEncMiscParameterBufferMaxFrameSize>() - 4usize];
    ["Offset of field: _VAEncMiscParameterBufferMaxFrameSize::type_"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferMaxFrameSize, type_) - 0usize];
    ["Offset of field: _VAEncMiscParameterBufferMaxFrameSize::max_frame_size"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferMaxFrameSize, max_frame_size) - 4usize];
    ["Offset of field: _VAEncMiscParameterBufferMaxFrameSize::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferMaxFrameSize, va_reserved) - 8usize];
};
pub type VAEncMiscParameterBufferMaxFrameSize = _VAEncMiscParameterBufferMaxFrameSize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferMultiPassFrameSize {
    pub type_: VAEncMiscParameterType,
    pub max_frame_size: u32,
    pub reserved: u32,
    pub num_passes: u8,
    pub delta_qp: *mut u8,
    pub va_reserved: [::std::os::raw::c_ulong; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBufferMultiPassFrameSize"]
        [::std::mem::size_of::<_VAEncMiscParameterBufferMultiPassFrameSize>() - 56usize];
    ["Alignment of _VAEncMiscParameterBufferMultiPassFrameSize"]
        [::std::mem::align_of::<_VAEncMiscParameterBufferMultiPassFrameSize>() - 8usize];
    ["Offset of field: _VAEncMiscParameterBufferMultiPassFrameSize::type_"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferMultiPassFrameSize, type_) - 0usize];
    ["Offset of field: _VAEncMiscParameterBufferMultiPassFrameSize::max_frame_size"][::std::mem::offset_of!(
        _VAEncMiscParameterBufferMultiPassFrameSize,
        max_frame_size
    ) - 4usize];
    ["Offset of field: _VAEncMiscParameterBufferMultiPassFrameSize::reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferMultiPassFrameSize, reserved) - 8usize];
    ["Offset of field: _VAEncMiscParameterBufferMultiPassFrameSize::num_passes"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferMultiPassFrameSize, num_passes) - 12usize];
    ["Offset of field: _VAEncMiscParameterBufferMultiPassFrameSize::delta_qp"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferMultiPassFrameSize, delta_qp) - 16usize];
    ["Offset of field: _VAEncMiscParameterBufferMultiPassFrameSize::va_reserved"][::std::mem::offset_of!(
        _VAEncMiscParameterBufferMultiPassFrameSize,
        va_reserved
    ) - 24usize];
};
pub type VAEncMiscParameterBufferMultiPassFrameSize = _VAEncMiscParameterBufferMultiPassFrameSize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferQualityLevel {
    pub quality_level: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBufferQualityLevel"]
        [::std::mem::size_of::<_VAEncMiscParameterBufferQualityLevel>() - 20usize];
    ["Alignment of _VAEncMiscParameterBufferQualityLevel"]
        [::std::mem::align_of::<_VAEncMiscParameterBufferQualityLevel>() - 4usize];
    ["Offset of field: _VAEncMiscParameterBufferQualityLevel::quality_level"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferQualityLevel, quality_level) - 0usize];
    ["Offset of field: _VAEncMiscParameterBufferQualityLevel::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferQualityLevel, va_reserved) - 4usize];
};
pub type VAEncMiscParameterBufferQualityLevel = _VAEncMiscParameterBufferQualityLevel;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterQuantization {
    pub quantization_flags: _VAEncMiscParameterQuantization__bindgen_ty_1,
    pub va_reserved: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterQuantization__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1>()
            - 4usize];
};
impl _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn disable_trellis(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disable_trellis(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_trellis_I(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_trellis_I(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_trellis_P(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_trellis_P(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_trellis_B(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_trellis_B(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        disable_trellis: u32,
        enable_trellis_I: u32,
        enable_trellis_P: u32,
        enable_trellis_B: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let disable_trellis: u32 = unsafe { ::std::mem::transmute(disable_trellis) };
            disable_trellis as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enable_trellis_I: u32 = unsafe { ::std::mem::transmute(enable_trellis_I) };
            enable_trellis_I as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let enable_trellis_P: u32 = unsafe { ::std::mem::transmute(enable_trellis_P) };
            enable_trellis_P as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let enable_trellis_B: u32 = unsafe { ::std::mem::transmute(enable_trellis_B) };
            enable_trellis_B as u64
        });
        __bindgen_bitfield_unit.set(4usize, 28u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterQuantization__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterQuantization__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterQuantization__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterQuantization__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncMiscParameterQuantization__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAEncMiscParameterQuantization__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAEncMiscParameterQuantization__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAEncMiscParameterQuantization__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterQuantization"]
        [::std::mem::size_of::<_VAEncMiscParameterQuantization>() - 8usize];
    ["Alignment of _VAEncMiscParameterQuantization"]
        [::std::mem::align_of::<_VAEncMiscParameterQuantization>() - 4usize];
    ["Offset of field: _VAEncMiscParameterQuantization::quantization_flags"]
        [::std::mem::offset_of!(_VAEncMiscParameterQuantization, quantization_flags) - 0usize];
    ["Offset of field: _VAEncMiscParameterQuantization::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterQuantization, va_reserved) - 4usize];
};
pub type VAEncMiscParameterQuantization = _VAEncMiscParameterQuantization;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterSkipFrame {
    pub skip_frame_flag: u8,
    pub num_skip_frames: u8,
    pub size_skip_frames: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterSkipFrame"]
        [::std::mem::size_of::<_VAEncMiscParameterSkipFrame>() - 24usize];
    ["Alignment of _VAEncMiscParameterSkipFrame"]
        [::std::mem::align_of::<_VAEncMiscParameterSkipFrame>() - 4usize];
    ["Offset of field: _VAEncMiscParameterSkipFrame::skip_frame_flag"]
        [::std::mem::offset_of!(_VAEncMiscParameterSkipFrame, skip_frame_flag) - 0usize];
    ["Offset of field: _VAEncMiscParameterSkipFrame::num_skip_frames"]
        [::std::mem::offset_of!(_VAEncMiscParameterSkipFrame, num_skip_frames) - 1usize];
    ["Offset of field: _VAEncMiscParameterSkipFrame::size_skip_frames"]
        [::std::mem::offset_of!(_VAEncMiscParameterSkipFrame, size_skip_frames) - 4usize];
    ["Offset of field: _VAEncMiscParameterSkipFrame::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterSkipFrame, va_reserved) - 8usize];
};
pub type VAEncMiscParameterSkipFrame = _VAEncMiscParameterSkipFrame;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncROI {
    pub roi_rectangle: VARectangle,
    pub roi_value: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncROI"][::std::mem::size_of::<_VAEncROI>() - 10usize];
    ["Alignment of _VAEncROI"][::std::mem::align_of::<_VAEncROI>() - 2usize];
    ["Offset of field: _VAEncROI::roi_rectangle"]
        [::std::mem::offset_of!(_VAEncROI, roi_rectangle) - 0usize];
    ["Offset of field: _VAEncROI::roi_value"]
        [::std::mem::offset_of!(_VAEncROI, roi_value) - 8usize];
};
pub type VAEncROI = _VAEncROI;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterBufferROI {
    pub num_roi: u32,
    pub max_delta_qp: i8,
    pub min_delta_qp: i8,
    pub roi: *mut VAEncROI,
    pub roi_flags: _VAEncMiscParameterBufferROI__bindgen_ty_1,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterBufferROI__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn roi_value_is_qp_delta(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_value_is_qp_delta(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        roi_value_is_qp_delta: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let roi_value_is_qp_delta: u32 =
                unsafe { ::std::mem::transmute(roi_value_is_qp_delta) };
            roi_value_is_qp_delta as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBufferROI__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterBufferROI__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterBufferROI__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterBufferROI__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncMiscParameterBufferROI__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAEncMiscParameterBufferROI__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBufferROI"]
        [::std::mem::size_of::<_VAEncMiscParameterBufferROI>() - 40usize];
    ["Alignment of _VAEncMiscParameterBufferROI"]
        [::std::mem::align_of::<_VAEncMiscParameterBufferROI>() - 8usize];
    ["Offset of field: _VAEncMiscParameterBufferROI::num_roi"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI, num_roi) - 0usize];
    ["Offset of field: _VAEncMiscParameterBufferROI::max_delta_qp"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI, max_delta_qp) - 4usize];
    ["Offset of field: _VAEncMiscParameterBufferROI::min_delta_qp"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI, min_delta_qp) - 5usize];
    ["Offset of field: _VAEncMiscParameterBufferROI::roi"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI, roi) - 8usize];
    ["Offset of field: _VAEncMiscParameterBufferROI::roi_flags"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI, roi_flags) - 16usize];
    ["Offset of field: _VAEncMiscParameterBufferROI::va_reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferROI, va_reserved) - 20usize];
};
pub type VAEncMiscParameterBufferROI = _VAEncMiscParameterBufferROI;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferDirtyRect {
    pub num_roi_rectangle: u32,
    pub roi_rectangle: *mut VARectangle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterBufferDirtyRect"]
        [::std::mem::size_of::<_VAEncMiscParameterBufferDirtyRect>() - 16usize];
    ["Alignment of _VAEncMiscParameterBufferDirtyRect"]
        [::std::mem::align_of::<_VAEncMiscParameterBufferDirtyRect>() - 8usize];
    ["Offset of field: _VAEncMiscParameterBufferDirtyRect::num_roi_rectangle"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferDirtyRect, num_roi_rectangle) - 0usize];
    ["Offset of field: _VAEncMiscParameterBufferDirtyRect::roi_rectangle"]
        [::std::mem::offset_of!(_VAEncMiscParameterBufferDirtyRect, roi_rectangle) - 8usize];
};
pub type VAEncMiscParameterBufferDirtyRect = _VAEncMiscParameterBufferDirtyRect;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterParallelRateControl {
    pub num_layers: u32,
    pub num_b_in_gop: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterParallelRateControl"]
        [::std::mem::size_of::<_VAEncMiscParameterParallelRateControl>() - 16usize];
    ["Alignment of _VAEncMiscParameterParallelRateControl"]
        [::std::mem::align_of::<_VAEncMiscParameterParallelRateControl>() - 8usize];
    ["Offset of field: _VAEncMiscParameterParallelRateControl::num_layers"]
        [::std::mem::offset_of!(_VAEncMiscParameterParallelRateControl, num_layers) - 0usize];
    ["Offset of field: _VAEncMiscParameterParallelRateControl::num_b_in_gop"]
        [::std::mem::offset_of!(_VAEncMiscParameterParallelRateControl, num_b_in_gop) - 8usize];
};
pub type VAEncMiscParameterParallelRateControl = _VAEncMiscParameterParallelRateControl;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterEncQuality {
    pub __bindgen_anon_1: _VAEncMiscParameterEncQuality__bindgen_ty_1,
    pub FTQSkipThresholdLUT: [u8; 52usize],
    pub NonFTQSkipThresholdLUT: [u16; 52usize],
    pub reserved: [u32; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterEncQuality__bindgen_ty_1 {
    pub __bindgen_anon_1: _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1,
    pub encControls: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn useRawPicForRef(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_useRawPicForRef(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn skipCheckDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_skipCheckDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FTQOverride(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FTQOverride(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FTQEnable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FTQEnable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FTQSkipThresholdLUTInput(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FTQSkipThresholdLUTInput(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn NonFTQSkipThresholdLUTInput(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NonFTQSkipThresholdLUTInput(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ReservedBit(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ReservedBit(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn directBiasAdjustmentEnable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_directBiasAdjustmentEnable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn globalMotionBiasAdjustmentEnable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_globalMotionBiasAdjustmentEnable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn HMEMVCostScalingFactor(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_HMEMVCostScalingFactor(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn HMEDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HMEDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SuperHMEDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SuperHMEDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn UltraHMEDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_UltraHMEDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn PanicModeDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_PanicModeDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ForceRepartitionCheck(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_ForceRepartitionCheck(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        useRawPicForRef: u32,
        skipCheckDisable: u32,
        FTQOverride: u32,
        FTQEnable: u32,
        FTQSkipThresholdLUTInput: u32,
        NonFTQSkipThresholdLUTInput: u32,
        ReservedBit: u32,
        directBiasAdjustmentEnable: u32,
        globalMotionBiasAdjustmentEnable: u32,
        HMEMVCostScalingFactor: u32,
        HMEDisable: u32,
        SuperHMEDisable: u32,
        UltraHMEDisable: u32,
        PanicModeDisable: u32,
        ForceRepartitionCheck: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let useRawPicForRef: u32 = unsafe { ::std::mem::transmute(useRawPicForRef) };
            useRawPicForRef as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let skipCheckDisable: u32 = unsafe { ::std::mem::transmute(skipCheckDisable) };
            skipCheckDisable as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FTQOverride: u32 = unsafe { ::std::mem::transmute(FTQOverride) };
            FTQOverride as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let FTQEnable: u32 = unsafe { ::std::mem::transmute(FTQEnable) };
            FTQEnable as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let FTQSkipThresholdLUTInput: u32 =
                unsafe { ::std::mem::transmute(FTQSkipThresholdLUTInput) };
            FTQSkipThresholdLUTInput as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let NonFTQSkipThresholdLUTInput: u32 =
                unsafe { ::std::mem::transmute(NonFTQSkipThresholdLUTInput) };
            NonFTQSkipThresholdLUTInput as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let ReservedBit: u32 = unsafe { ::std::mem::transmute(ReservedBit) };
            ReservedBit as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let directBiasAdjustmentEnable: u32 =
                unsafe { ::std::mem::transmute(directBiasAdjustmentEnable) };
            directBiasAdjustmentEnable as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let globalMotionBiasAdjustmentEnable: u32 =
                unsafe { ::std::mem::transmute(globalMotionBiasAdjustmentEnable) };
            globalMotionBiasAdjustmentEnable as u64
        });
        __bindgen_bitfield_unit.set(9usize, 2u8, {
            let HMEMVCostScalingFactor: u32 =
                unsafe { ::std::mem::transmute(HMEMVCostScalingFactor) };
            HMEMVCostScalingFactor as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let HMEDisable: u32 = unsafe { ::std::mem::transmute(HMEDisable) };
            HMEDisable as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let SuperHMEDisable: u32 = unsafe { ::std::mem::transmute(SuperHMEDisable) };
            SuperHMEDisable as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let UltraHMEDisable: u32 = unsafe { ::std::mem::transmute(UltraHMEDisable) };
            UltraHMEDisable as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let PanicModeDisable: u32 = unsafe { ::std::mem::transmute(PanicModeDisable) };
            PanicModeDisable as u64
        });
        __bindgen_bitfield_unit.set(15usize, 2u8, {
            let ForceRepartitionCheck: u32 =
                unsafe { ::std::mem::transmute(ForceRepartitionCheck) };
            ForceRepartitionCheck as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterEncQuality__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterEncQuality__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterEncQuality__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterEncQuality__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncMiscParameterEncQuality__bindgen_ty_1::encControls"]
        [::std::mem::offset_of!(_VAEncMiscParameterEncQuality__bindgen_ty_1, encControls) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterEncQuality"]
        [::std::mem::size_of::<_VAEncMiscParameterEncQuality>() - 224usize];
    ["Alignment of _VAEncMiscParameterEncQuality"]
        [::std::mem::align_of::<_VAEncMiscParameterEncQuality>() - 4usize];
    ["Offset of field: _VAEncMiscParameterEncQuality::FTQSkipThresholdLUT"]
        [::std::mem::offset_of!(_VAEncMiscParameterEncQuality, FTQSkipThresholdLUT) - 4usize];
    ["Offset of field: _VAEncMiscParameterEncQuality::NonFTQSkipThresholdLUT"]
        [::std::mem::offset_of!(_VAEncMiscParameterEncQuality, NonFTQSkipThresholdLUT) - 56usize];
    ["Offset of field: _VAEncMiscParameterEncQuality::reserved"]
        [::std::mem::offset_of!(_VAEncMiscParameterEncQuality, reserved) - 160usize];
};
pub type VAEncMiscParameterEncQuality = _VAEncMiscParameterEncQuality;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterCustomRoundingControl {
    pub rounding_offset_setting: _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1>(
        ) - 4usize];
    ["Alignment of _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<
            _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1,
        >() - 4usize];
};
impl _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn enable_custom_rouding_intra(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_custom_rouding_intra(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rounding_offset_intra(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_rounding_offset_intra(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_custom_rounding_inter(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_custom_rounding_inter(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rounding_offset_inter(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_rounding_offset_inter(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        enable_custom_rouding_intra: u32,
        rounding_offset_intra: u32,
        enable_custom_rounding_inter: u32,
        rounding_offset_inter: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enable_custom_rouding_intra: u32 =
                unsafe { ::std::mem::transmute(enable_custom_rouding_intra) };
            enable_custom_rouding_intra as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let rounding_offset_intra: u32 =
                unsafe { ::std::mem::transmute(rounding_offset_intra) };
            rounding_offset_intra as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let enable_custom_rounding_inter: u32 =
                unsafe { ::std::mem::transmute(enable_custom_rounding_inter) };
            enable_custom_rounding_inter as u64
        });
        __bindgen_bitfield_unit.set(9usize, 7u8, {
            let rounding_offset_inter: u32 =
                unsafe { ::std::mem::transmute(rounding_offset_inter) };
            rounding_offset_inter as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1::bits"][::std::mem::offset_of!(
        _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1,
        bits
    ) - 0usize];
    ["Offset of field: _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1::value"][::std::mem::offset_of!(
        _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1,
        value
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncMiscParameterCustomRoundingControl"]
        [::std::mem::size_of::<_VAEncMiscParameterCustomRoundingControl>() - 4usize];
    ["Alignment of _VAEncMiscParameterCustomRoundingControl"]
        [::std::mem::align_of::<_VAEncMiscParameterCustomRoundingControl>() - 4usize];
    ["Offset of field: _VAEncMiscParameterCustomRoundingControl::rounding_offset_setting"][::std::mem::offset_of!(
        _VAEncMiscParameterCustomRoundingControl,
        rounding_offset_setting
    )
        - 0usize];
};
pub type VAEncMiscParameterCustomRoundingControl = _VAEncMiscParameterCustomRoundingControl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferBase {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASliceParameterBufferBase"]
        [::std::mem::size_of::<_VASliceParameterBufferBase>() - 12usize];
    ["Alignment of _VASliceParameterBufferBase"]
        [::std::mem::align_of::<_VASliceParameterBufferBase>() - 4usize];
    ["Offset of field: _VASliceParameterBufferBase::slice_data_size"]
        [::std::mem::offset_of!(_VASliceParameterBufferBase, slice_data_size) - 0usize];
    ["Offset of field: _VASliceParameterBufferBase::slice_data_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferBase, slice_data_offset) - 4usize];
    ["Offset of field: _VASliceParameterBufferBase::slice_data_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferBase, slice_data_flag) - 8usize];
};
pub type VASliceParameterBufferBase = _VASliceParameterBufferBase;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAHuffmanTableBufferJPEGBaseline {
    pub load_huffman_table: [u8; 2usize],
    pub huffman_table: [_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1; 2usize],
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1 {
    pub num_dc_codes: [u8; 16usize],
    pub dc_values: [u8; 12usize],
    pub num_ac_codes: [u8; 16usize],
    pub ac_values: [u8; 162usize],
    pub pad: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1"]
        [::std::mem::size_of::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>() - 208usize];
    ["Alignment of _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1"]
        [::std::mem::align_of::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>() - 1usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1::num_dc_codes"][::std::mem::offset_of!(
        _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1,
        num_dc_codes
    ) - 0usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1::dc_values"][::std::mem::offset_of!(
        _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1,
        dc_values
    ) - 16usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1::num_ac_codes"][::std::mem::offset_of!(
        _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1,
        num_ac_codes
    ) - 28usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1::ac_values"][::std::mem::offset_of!(
        _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1,
        ac_values
    ) - 44usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1, pad) - 206usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAHuffmanTableBufferJPEGBaseline"]
        [::std::mem::size_of::<_VAHuffmanTableBufferJPEGBaseline>() - 436usize];
    ["Alignment of _VAHuffmanTableBufferJPEGBaseline"]
        [::std::mem::align_of::<_VAHuffmanTableBufferJPEGBaseline>() - 4usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline::load_huffman_table"]
        [::std::mem::offset_of!(_VAHuffmanTableBufferJPEGBaseline, load_huffman_table) - 0usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline::huffman_table"]
        [::std::mem::offset_of!(_VAHuffmanTableBufferJPEGBaseline, huffman_table) - 2usize];
    ["Offset of field: _VAHuffmanTableBufferJPEGBaseline::va_reserved"]
        [::std::mem::offset_of!(_VAHuffmanTableBufferJPEGBaseline, va_reserved) - 420usize];
};
pub type VAHuffmanTableBufferJPEGBaseline = _VAHuffmanTableBufferJPEGBaseline;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG2 {
    pub horizontal_size: u16,
    pub vertical_size: u16,
    pub forward_reference_picture: VASurfaceID,
    pub backward_reference_picture: VASurfaceID,
    pub picture_coding_type: i32,
    pub f_code: i32,
    pub picture_coding_extension: _VAPictureParameterBufferMPEG2__bindgen_ty_1,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferMPEG2__bindgen_ty_1 {
    pub bits: _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn intra_dc_precision(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_intra_dc_precision(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn picture_structure(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_picture_structure(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn top_field_first(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_top_field_first(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_pred_frame_dct(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_frame_pred_frame_dct(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn concealment_motion_vectors(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_concealment_motion_vectors(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn q_scale_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_q_scale_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn intra_vlc_format(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_intra_vlc_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn alternate_scan(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_alternate_scan(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn repeat_first_field(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_repeat_first_field(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn progressive_frame(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_progressive_frame(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_first_field(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_first_field(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        intra_dc_precision: u32,
        picture_structure: u32,
        top_field_first: u32,
        frame_pred_frame_dct: u32,
        concealment_motion_vectors: u32,
        q_scale_type: u32,
        intra_vlc_format: u32,
        alternate_scan: u32,
        repeat_first_field: u32,
        progressive_frame: u32,
        is_first_field: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let intra_dc_precision: u32 = unsafe { ::std::mem::transmute(intra_dc_precision) };
            intra_dc_precision as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let picture_structure: u32 = unsafe { ::std::mem::transmute(picture_structure) };
            picture_structure as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let top_field_first: u32 = unsafe { ::std::mem::transmute(top_field_first) };
            top_field_first as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let frame_pred_frame_dct: u32 = unsafe { ::std::mem::transmute(frame_pred_frame_dct) };
            frame_pred_frame_dct as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let concealment_motion_vectors: u32 =
                unsafe { ::std::mem::transmute(concealment_motion_vectors) };
            concealment_motion_vectors as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let q_scale_type: u32 = unsafe { ::std::mem::transmute(q_scale_type) };
            q_scale_type as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let intra_vlc_format: u32 = unsafe { ::std::mem::transmute(intra_vlc_format) };
            intra_vlc_format as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let alternate_scan: u32 = unsafe { ::std::mem::transmute(alternate_scan) };
            alternate_scan as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let repeat_first_field: u32 = unsafe { ::std::mem::transmute(repeat_first_field) };
            repeat_first_field as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let progressive_frame: u32 = unsafe { ::std::mem::transmute(progressive_frame) };
            progressive_frame as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let is_first_field: u32 = unsafe { ::std::mem::transmute(is_first_field) };
            is_first_field as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG2__bindgen_ty_1"]
        [::std::mem::size_of::<_VAPictureParameterBufferMPEG2__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAPictureParameterBufferMPEG2__bindgen_ty_1"]
        [::std::mem::align_of::<_VAPictureParameterBufferMPEG2__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG2__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG2__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG2"]
        [::std::mem::size_of::<_VAPictureParameterBufferMPEG2>() - 40usize];
    ["Alignment of _VAPictureParameterBufferMPEG2"]
        [::std::mem::align_of::<_VAPictureParameterBufferMPEG2>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::horizontal_size"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG2, horizontal_size) - 0usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::vertical_size"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG2, vertical_size) - 2usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::forward_reference_picture"][::std::mem::offset_of!(
        _VAPictureParameterBufferMPEG2,
        forward_reference_picture
    ) - 4usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::backward_reference_picture"][::std::mem::offset_of!(
        _VAPictureParameterBufferMPEG2,
        backward_reference_picture
    ) - 8usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::picture_coding_type"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG2, picture_coding_type) - 12usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::f_code"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG2, f_code) - 16usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::picture_coding_extension"][::std::mem::offset_of!(
        _VAPictureParameterBufferMPEG2,
        picture_coding_extension
    ) - 20usize];
    ["Offset of field: _VAPictureParameterBufferMPEG2::va_reserved"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG2, va_reserved) - 24usize];
};
pub type VAPictureParameterBufferMPEG2 = _VAPictureParameterBufferMPEG2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAIQMatrixBufferMPEG2 {
    pub load_intra_quantiser_matrix: i32,
    pub load_non_intra_quantiser_matrix: i32,
    pub load_chroma_intra_quantiser_matrix: i32,
    pub load_chroma_non_intra_quantiser_matrix: i32,
    pub intra_quantiser_matrix: [u8; 64usize],
    pub non_intra_quantiser_matrix: [u8; 64usize],
    pub chroma_intra_quantiser_matrix: [u8; 64usize],
    pub chroma_non_intra_quantiser_matrix: [u8; 64usize],
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAIQMatrixBufferMPEG2"][::std::mem::size_of::<_VAIQMatrixBufferMPEG2>() - 288usize];
    ["Alignment of _VAIQMatrixBufferMPEG2"]
        [::std::mem::align_of::<_VAIQMatrixBufferMPEG2>() - 4usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::load_intra_quantiser_matrix"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG2, load_intra_quantiser_matrix) - 0usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::load_non_intra_quantiser_matrix"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG2, load_non_intra_quantiser_matrix) - 4usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::load_chroma_intra_quantiser_matrix"][::std::mem::offset_of!(
        _VAIQMatrixBufferMPEG2,
        load_chroma_intra_quantiser_matrix
    ) - 8usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::load_chroma_non_intra_quantiser_matrix"][::std::mem::offset_of!(
        _VAIQMatrixBufferMPEG2,
        load_chroma_non_intra_quantiser_matrix
    )
        - 12usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::intra_quantiser_matrix"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG2, intra_quantiser_matrix) - 16usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::non_intra_quantiser_matrix"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG2, non_intra_quantiser_matrix) - 80usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::chroma_intra_quantiser_matrix"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG2, chroma_intra_quantiser_matrix) - 144usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::chroma_non_intra_quantiser_matrix"][::std::mem::offset_of!(
        _VAIQMatrixBufferMPEG2,
        chroma_non_intra_quantiser_matrix
    ) - 208usize];
    ["Offset of field: _VAIQMatrixBufferMPEG2::va_reserved"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG2, va_reserved) - 272usize];
};
pub type VAIQMatrixBufferMPEG2 = _VAIQMatrixBufferMPEG2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferMPEG2 {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
    pub macroblock_offset: u32,
    pub slice_horizontal_position: u32,
    pub slice_vertical_position: u32,
    pub quantiser_scale_code: i32,
    pub intra_slice_flag: i32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASliceParameterBufferMPEG2"]
        [::std::mem::size_of::<_VASliceParameterBufferMPEG2>() - 48usize];
    ["Alignment of _VASliceParameterBufferMPEG2"]
        [::std::mem::align_of::<_VASliceParameterBufferMPEG2>() - 4usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::slice_data_size"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, slice_data_size) - 0usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::slice_data_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, slice_data_offset) - 4usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::slice_data_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, slice_data_flag) - 8usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::macroblock_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, macroblock_offset) - 12usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::slice_horizontal_position"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, slice_horizontal_position) - 16usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::slice_vertical_position"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, slice_vertical_position) - 20usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::quantiser_scale_code"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, quantiser_scale_code) - 24usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::intra_slice_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, intra_slice_flag) - 28usize];
    ["Offset of field: _VASliceParameterBufferMPEG2::va_reserved"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG2, va_reserved) - 32usize];
};
pub type VASliceParameterBufferMPEG2 = _VASliceParameterBufferMPEG2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAMacroblockParameterBufferMPEG2 {
    pub macroblock_address: u16,
    pub macroblock_type: u8,
    pub macroblock_modes: _VAMacroblockParameterBufferMPEG2__bindgen_ty_1,
    pub motion_vertical_field_select: u8,
    pub PMV: [[[i16; 2usize]; 2usize]; 2usize],
    pub coded_block_pattern: u16,
    pub num_skipped_macroblocks: u16,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAMacroblockParameterBufferMPEG2__bindgen_ty_1 {
    pub bits: _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1>()
            - 4usize];
};
impl _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn frame_motion_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_frame_motion_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn field_motion_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_field_motion_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dct_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dct_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        frame_motion_type: u32,
        field_motion_type: u32,
        dct_type: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let frame_motion_type: u32 = unsafe { ::std::mem::transmute(frame_motion_type) };
            frame_motion_type as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let field_motion_type: u32 = unsafe { ::std::mem::transmute(field_motion_type) };
            field_motion_type as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let dct_type: u32 = unsafe { ::std::mem::transmute(dct_type) };
            dct_type as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAMacroblockParameterBufferMPEG2__bindgen_ty_1"]
        [::std::mem::size_of::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAMacroblockParameterBufferMPEG2__bindgen_ty_1"]
        [::std::mem::align_of::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAMacroblockParameterBufferMPEG2"]
        [::std::mem::size_of::<_VAMacroblockParameterBufferMPEG2>() - 48usize];
    ["Alignment of _VAMacroblockParameterBufferMPEG2"]
        [::std::mem::align_of::<_VAMacroblockParameterBufferMPEG2>() - 4usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::macroblock_address"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2, macroblock_address) - 0usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::macroblock_type"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2, macroblock_type) - 2usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::macroblock_modes"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2, macroblock_modes) - 4usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::motion_vertical_field_select"][::std::mem::offset_of!(
        _VAMacroblockParameterBufferMPEG2,
        motion_vertical_field_select
    )
        - 8usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::PMV"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2, PMV) - 10usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::coded_block_pattern"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2, coded_block_pattern) - 26usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::num_skipped_macroblocks"][::std::mem::offset_of!(
        _VAMacroblockParameterBufferMPEG2,
        num_skipped_macroblocks
    ) - 28usize];
    ["Offset of field: _VAMacroblockParameterBufferMPEG2::va_reserved"]
        [::std::mem::offset_of!(_VAMacroblockParameterBufferMPEG2, va_reserved) - 32usize];
};
pub type VAMacroblockParameterBufferMPEG2 = _VAMacroblockParameterBufferMPEG2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG4 {
    pub vop_width: u16,
    pub vop_height: u16,
    pub forward_reference_picture: VASurfaceID,
    pub backward_reference_picture: VASurfaceID,
    pub vol_fields: _VAPictureParameterBufferMPEG4__bindgen_ty_1,
    pub no_of_sprite_warping_points: u8,
    pub sprite_trajectory_du: [i16; 3usize],
    pub sprite_trajectory_dv: [i16; 3usize],
    pub quant_precision: u8,
    pub vop_fields: _VAPictureParameterBufferMPEG4__bindgen_ty_2,
    pub vop_fcode_forward: u8,
    pub vop_fcode_backward: u8,
    pub vop_time_increment_resolution: u16,
    pub num_gobs_in_vop: u8,
    pub num_macroblocks_in_gob: u8,
    pub TRB: i16,
    pub TRD: i16,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferMPEG4__bindgen_ty_1 {
    pub bits: _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn short_video_header(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_short_video_header(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn chroma_format(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_chroma_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn interlaced(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlaced(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn obmc_disable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_obmc_disable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sprite_enable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_sprite_enable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn sprite_warping_accuracy(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_sprite_warping_accuracy(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn quant_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_quant_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn quarter_sample(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_quarter_sample(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn data_partitioned(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_data_partitioned(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reversible_vlc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reversible_vlc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn resync_marker_disable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_resync_marker_disable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        short_video_header: u32,
        chroma_format: u32,
        interlaced: u32,
        obmc_disable: u32,
        sprite_enable: u32,
        sprite_warping_accuracy: u32,
        quant_type: u32,
        quarter_sample: u32,
        data_partitioned: u32,
        reversible_vlc: u32,
        resync_marker_disable: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let short_video_header: u32 = unsafe { ::std::mem::transmute(short_video_header) };
            short_video_header as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let chroma_format: u32 = unsafe { ::std::mem::transmute(chroma_format) };
            chroma_format as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let interlaced: u32 = unsafe { ::std::mem::transmute(interlaced) };
            interlaced as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let obmc_disable: u32 = unsafe { ::std::mem::transmute(obmc_disable) };
            obmc_disable as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let sprite_enable: u32 = unsafe { ::std::mem::transmute(sprite_enable) };
            sprite_enable as u64
        });
        __bindgen_bitfield_unit.set(7usize, 2u8, {
            let sprite_warping_accuracy: u32 =
                unsafe { ::std::mem::transmute(sprite_warping_accuracy) };
            sprite_warping_accuracy as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let quant_type: u32 = unsafe { ::std::mem::transmute(quant_type) };
            quant_type as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let quarter_sample: u32 = unsafe { ::std::mem::transmute(quarter_sample) };
            quarter_sample as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let data_partitioned: u32 = unsafe { ::std::mem::transmute(data_partitioned) };
            data_partitioned as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let reversible_vlc: u32 = unsafe { ::std::mem::transmute(reversible_vlc) };
            reversible_vlc as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let resync_marker_disable: u32 =
                unsafe { ::std::mem::transmute(resync_marker_disable) };
            resync_marker_disable as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG4__bindgen_ty_1"]
        [::std::mem::size_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAPictureParameterBufferMPEG4__bindgen_ty_1"]
        [::std::mem::align_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4__bindgen_ty_1, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferMPEG4__bindgen_ty_2 {
    pub bits: _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn vop_coding_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_vop_coding_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn backward_reference_vop_coding_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_backward_reference_vop_coding_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn vop_rounding_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_vop_rounding_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn intra_dc_vlc_thr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_intra_dc_vlc_thr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn top_field_first(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_top_field_first(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn alternate_vertical_scan_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_alternate_vertical_scan_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        vop_coding_type: u32,
        backward_reference_vop_coding_type: u32,
        vop_rounding_type: u32,
        intra_dc_vlc_thr: u32,
        top_field_first: u32,
        alternate_vertical_scan_flag: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let vop_coding_type: u32 = unsafe { ::std::mem::transmute(vop_coding_type) };
            vop_coding_type as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let backward_reference_vop_coding_type: u32 =
                unsafe { ::std::mem::transmute(backward_reference_vop_coding_type) };
            backward_reference_vop_coding_type as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let vop_rounding_type: u32 = unsafe { ::std::mem::transmute(vop_rounding_type) };
            vop_rounding_type as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let intra_dc_vlc_thr: u32 = unsafe { ::std::mem::transmute(intra_dc_vlc_thr) };
            intra_dc_vlc_thr as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let top_field_first: u32 = unsafe { ::std::mem::transmute(top_field_first) };
            top_field_first as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let alternate_vertical_scan_flag: u32 =
                unsafe { ::std::mem::transmute(alternate_vertical_scan_flag) };
            alternate_vertical_scan_flag as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG4__bindgen_ty_2"]
        [::std::mem::size_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_2>() - 4usize];
    ["Alignment of _VAPictureParameterBufferMPEG4__bindgen_ty_2"]
        [::std::mem::align_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_2>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4__bindgen_ty_2::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4__bindgen_ty_2, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4__bindgen_ty_2::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4__bindgen_ty_2, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferMPEG4"]
        [::std::mem::size_of::<_VAPictureParameterBufferMPEG4>() - 64usize];
    ["Alignment of _VAPictureParameterBufferMPEG4"]
        [::std::mem::align_of::<_VAPictureParameterBufferMPEG4>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::vop_width"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, vop_width) - 0usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::vop_height"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, vop_height) - 2usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::forward_reference_picture"][::std::mem::offset_of!(
        _VAPictureParameterBufferMPEG4,
        forward_reference_picture
    ) - 4usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::backward_reference_picture"][::std::mem::offset_of!(
        _VAPictureParameterBufferMPEG4,
        backward_reference_picture
    ) - 8usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::vol_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, vol_fields) - 12usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::no_of_sprite_warping_points"][::std::mem::offset_of!(
        _VAPictureParameterBufferMPEG4,
        no_of_sprite_warping_points
    ) - 16usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::sprite_trajectory_du"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, sprite_trajectory_du) - 18usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::sprite_trajectory_dv"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, sprite_trajectory_dv) - 24usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::quant_precision"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, quant_precision) - 30usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::vop_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, vop_fields) - 32usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::vop_fcode_forward"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, vop_fcode_forward) - 36usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::vop_fcode_backward"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, vop_fcode_backward) - 37usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::vop_time_increment_resolution"][::std::mem::offset_of!(
        _VAPictureParameterBufferMPEG4,
        vop_time_increment_resolution
    ) - 38usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::num_gobs_in_vop"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, num_gobs_in_vop) - 40usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::num_macroblocks_in_gob"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, num_macroblocks_in_gob) - 41usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::TRB"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, TRB) - 42usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::TRD"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, TRD) - 44usize];
    ["Offset of field: _VAPictureParameterBufferMPEG4::va_reserved"]
        [::std::mem::offset_of!(_VAPictureParameterBufferMPEG4, va_reserved) - 48usize];
};
pub type VAPictureParameterBufferMPEG4 = _VAPictureParameterBufferMPEG4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAIQMatrixBufferMPEG4 {
    pub load_intra_quant_mat: i32,
    pub load_non_intra_quant_mat: i32,
    pub intra_quant_mat: [u8; 64usize],
    pub non_intra_quant_mat: [u8; 64usize],
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAIQMatrixBufferMPEG4"][::std::mem::size_of::<_VAIQMatrixBufferMPEG4>() - 152usize];
    ["Alignment of _VAIQMatrixBufferMPEG4"]
        [::std::mem::align_of::<_VAIQMatrixBufferMPEG4>() - 4usize];
    ["Offset of field: _VAIQMatrixBufferMPEG4::load_intra_quant_mat"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG4, load_intra_quant_mat) - 0usize];
    ["Offset of field: _VAIQMatrixBufferMPEG4::load_non_intra_quant_mat"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG4, load_non_intra_quant_mat) - 4usize];
    ["Offset of field: _VAIQMatrixBufferMPEG4::intra_quant_mat"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG4, intra_quant_mat) - 8usize];
    ["Offset of field: _VAIQMatrixBufferMPEG4::non_intra_quant_mat"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG4, non_intra_quant_mat) - 72usize];
    ["Offset of field: _VAIQMatrixBufferMPEG4::va_reserved"]
        [::std::mem::offset_of!(_VAIQMatrixBufferMPEG4, va_reserved) - 136usize];
};
pub type VAIQMatrixBufferMPEG4 = _VAIQMatrixBufferMPEG4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferMPEG4 {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
    pub macroblock_offset: u32,
    pub macroblock_number: u32,
    pub quant_scale: i32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASliceParameterBufferMPEG4"]
        [::std::mem::size_of::<_VASliceParameterBufferMPEG4>() - 40usize];
    ["Alignment of _VASliceParameterBufferMPEG4"]
        [::std::mem::align_of::<_VASliceParameterBufferMPEG4>() - 4usize];
    ["Offset of field: _VASliceParameterBufferMPEG4::slice_data_size"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG4, slice_data_size) - 0usize];
    ["Offset of field: _VASliceParameterBufferMPEG4::slice_data_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG4, slice_data_offset) - 4usize];
    ["Offset of field: _VASliceParameterBufferMPEG4::slice_data_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG4, slice_data_flag) - 8usize];
    ["Offset of field: _VASliceParameterBufferMPEG4::macroblock_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG4, macroblock_offset) - 12usize];
    ["Offset of field: _VASliceParameterBufferMPEG4::macroblock_number"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG4, macroblock_number) - 16usize];
    ["Offset of field: _VASliceParameterBufferMPEG4::quant_scale"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG4, quant_scale) - 20usize];
    ["Offset of field: _VASliceParameterBufferMPEG4::va_reserved"]
        [::std::mem::offset_of!(_VASliceParameterBufferMPEG4, va_reserved) - 24usize];
};
pub type VASliceParameterBufferMPEG4 = _VASliceParameterBufferMPEG4;
pub const VAMvMode1Mv: VAMvModeVC1 = 0;
pub const VAMvMode1MvHalfPel: VAMvModeVC1 = 1;
pub const VAMvMode1MvHalfPelBilinear: VAMvModeVC1 = 2;
pub const VAMvModeMixedMv: VAMvModeVC1 = 3;
pub const VAMvModeIntensityCompensation: VAMvModeVC1 = 4;
pub type VAMvModeVC1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAPictureParameterBufferVC1 {
    pub forward_reference_picture: VASurfaceID,
    pub backward_reference_picture: VASurfaceID,
    pub inloop_decoded_picture: VASurfaceID,
    pub sequence_fields: _VAPictureParameterBufferVC1__bindgen_ty_1,
    pub coded_width: u16,
    pub coded_height: u16,
    pub entrypoint_fields: _VAPictureParameterBufferVC1__bindgen_ty_2,
    pub conditional_overlap_flag: u8,
    pub fast_uvmc_flag: u8,
    pub range_mapping_fields: _VAPictureParameterBufferVC1__bindgen_ty_3,
    pub b_picture_fraction: u8,
    pub cbp_table: u8,
    pub mb_mode_table: u8,
    pub range_reduction_frame: u8,
    pub rounding_control: u8,
    pub post_processing: u8,
    pub picture_resolution_index: u8,
    pub luma_scale: u8,
    pub luma_shift: u8,
    pub picture_fields: _VAPictureParameterBufferVC1__bindgen_ty_4,
    pub raw_coding: _VAPictureParameterBufferVC1__bindgen_ty_5,
    pub bitplane_present: _VAPictureParameterBufferVC1__bindgen_ty_6,
    pub reference_fields: _VAPictureParameterBufferVC1__bindgen_ty_7,
    pub mv_fields: _VAPictureParameterBufferVC1__bindgen_ty_8,
    pub pic_quantizer_fields: _VAPictureParameterBufferVC1__bindgen_ty_9,
    pub transform_fields: _VAPictureParameterBufferVC1__bindgen_ty_10,
    pub luma_scale2: u8,
    pub luma_shift2: u8,
    pub intensity_compensation_field: u8,
    pub va_reserved: [u32; 7usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_1 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn pulldown(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pulldown(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn interlace(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlace(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn tfcntrflag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_tfcntrflag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn finterpflag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_finterpflag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn psf(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_psf(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn multires(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_multires(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn overlap(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_overlap(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn syncmarker(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_syncmarker(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rangered(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rangered(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn max_b_frames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_b_frames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn profile(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_profile(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pulldown: u32,
        interlace: u32,
        tfcntrflag: u32,
        finterpflag: u32,
        psf: u32,
        multires: u32,
        overlap: u32,
        syncmarker: u32,
        rangered: u32,
        max_b_frames: u32,
        profile: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let pulldown: u32 = unsafe { ::std::mem::transmute(pulldown) };
            pulldown as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let interlace: u32 = unsafe { ::std::mem::transmute(interlace) };
            interlace as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let tfcntrflag: u32 = unsafe { ::std::mem::transmute(tfcntrflag) };
            tfcntrflag as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let finterpflag: u32 = unsafe { ::std::mem::transmute(finterpflag) };
            finterpflag as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let psf: u32 = unsafe { ::std::mem::transmute(psf) };
            psf as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let multires: u32 = unsafe { ::std::mem::transmute(multires) };
            multires as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let overlap: u32 = unsafe { ::std::mem::transmute(overlap) };
            overlap as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let syncmarker: u32 = unsafe { ::std::mem::transmute(syncmarker) };
            syncmarker as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let rangered: u32 = unsafe { ::std::mem::transmute(rangered) };
            rangered as u64
        });
        __bindgen_bitfield_unit.set(9usize, 3u8, {
            let max_b_frames: u32 = unsafe { ::std::mem::transmute(max_b_frames) };
            max_b_frames as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let profile: u32 = unsafe { ::std::mem::transmute(profile) };
            profile as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_1"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_1"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_1, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_2 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn broken_link(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_broken_link(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn closed_entry(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_closed_entry(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn panscan_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_panscan_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn loopfilter(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_loopfilter(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        broken_link: u32,
        closed_entry: u32,
        panscan_flag: u32,
        loopfilter: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let broken_link: u32 = unsafe { ::std::mem::transmute(broken_link) };
            broken_link as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let closed_entry: u32 = unsafe { ::std::mem::transmute(closed_entry) };
            closed_entry as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let panscan_flag: u32 = unsafe { ::std::mem::transmute(panscan_flag) };
            panscan_flag as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let loopfilter: u32 = unsafe { ::std::mem::transmute(loopfilter) };
            loopfilter as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_2"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_2>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_2"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_2>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_2::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_2, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_2::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_2, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_3 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1 {
    #[inline]
    pub fn luma_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_luma_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn luma(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_luma(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn chroma_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_chroma_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn chroma(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_chroma(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        luma_flag: u32,
        luma: u32,
        chroma_flag: u32,
        chroma: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let luma_flag: u32 = unsafe { ::std::mem::transmute(luma_flag) };
            luma_flag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 3u8, {
            let luma: u32 = unsafe { ::std::mem::transmute(luma) };
            luma as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let chroma_flag: u32 = unsafe { ::std::mem::transmute(chroma_flag) };
            chroma_flag as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let chroma: u32 = unsafe { ::std::mem::transmute(chroma) };
            chroma as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_3"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_3>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_3"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_3>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_3::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_3, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_3::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_3, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_4 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1 {
    #[inline]
    pub fn picture_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_picture_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_coding_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_frame_coding_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn top_field_first(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_top_field_first(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_first_field(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_first_field(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn intensity_compensation(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_intensity_compensation(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        picture_type: u32,
        frame_coding_mode: u32,
        top_field_first: u32,
        is_first_field: u32,
        intensity_compensation: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let picture_type: u32 = unsafe { ::std::mem::transmute(picture_type) };
            picture_type as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let frame_coding_mode: u32 = unsafe { ::std::mem::transmute(frame_coding_mode) };
            frame_coding_mode as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let top_field_first: u32 = unsafe { ::std::mem::transmute(top_field_first) };
            top_field_first as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let is_first_field: u32 = unsafe { ::std::mem::transmute(is_first_field) };
            is_first_field as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let intensity_compensation: u32 =
                unsafe { ::std::mem::transmute(intensity_compensation) };
            intensity_compensation as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_4"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_4>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_4"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_4>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_4::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_4, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_4::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_4, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_5 {
    pub flags: _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1 {
    #[inline]
    pub fn mv_type_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mv_type_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn direct_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_direct_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn skip_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_skip_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn field_tx(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_field_tx(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn forward_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_forward_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ac_pred(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ac_pred(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn overflags(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_overflags(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        mv_type_mb: u32,
        direct_mb: u32,
        skip_mb: u32,
        field_tx: u32,
        forward_mb: u32,
        ac_pred: u32,
        overflags: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let mv_type_mb: u32 = unsafe { ::std::mem::transmute(mv_type_mb) };
            mv_type_mb as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let direct_mb: u32 = unsafe { ::std::mem::transmute(direct_mb) };
            direct_mb as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let skip_mb: u32 = unsafe { ::std::mem::transmute(skip_mb) };
            skip_mb as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let field_tx: u32 = unsafe { ::std::mem::transmute(field_tx) };
            field_tx as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let forward_mb: u32 = unsafe { ::std::mem::transmute(forward_mb) };
            forward_mb as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let ac_pred: u32 = unsafe { ::std::mem::transmute(ac_pred) };
            ac_pred as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let overflags: u32 = unsafe { ::std::mem::transmute(overflags) };
            overflags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_5"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_5>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_5"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_5>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_5::flags"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_5, flags) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_5::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_5, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_6 {
    pub flags: _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1 {
    #[inline]
    pub fn bp_mv_type_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_mv_type_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_direct_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_direct_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_skip_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_skip_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_field_tx(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_field_tx(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_forward_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_forward_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_ac_pred(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_ac_pred(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_overflags(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_overflags(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bp_mv_type_mb: u32,
        bp_direct_mb: u32,
        bp_skip_mb: u32,
        bp_field_tx: u32,
        bp_forward_mb: u32,
        bp_ac_pred: u32,
        bp_overflags: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bp_mv_type_mb: u32 = unsafe { ::std::mem::transmute(bp_mv_type_mb) };
            bp_mv_type_mb as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bp_direct_mb: u32 = unsafe { ::std::mem::transmute(bp_direct_mb) };
            bp_direct_mb as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bp_skip_mb: u32 = unsafe { ::std::mem::transmute(bp_skip_mb) };
            bp_skip_mb as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bp_field_tx: u32 = unsafe { ::std::mem::transmute(bp_field_tx) };
            bp_field_tx as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bp_forward_mb: u32 = unsafe { ::std::mem::transmute(bp_forward_mb) };
            bp_forward_mb as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bp_ac_pred: u32 = unsafe { ::std::mem::transmute(bp_ac_pred) };
            bp_ac_pred as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bp_overflags: u32 = unsafe { ::std::mem::transmute(bp_overflags) };
            bp_overflags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_6"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_6>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_6"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_6>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_6::flags"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_6, flags) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_6::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_6, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_7 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1 {
    #[inline]
    pub fn reference_distance_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reference_distance_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reference_distance(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_reference_distance(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn num_reference_pictures(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_num_reference_pictures(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reference_field_pic_indicator(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reference_field_pic_indicator(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        reference_distance_flag: u32,
        reference_distance: u32,
        num_reference_pictures: u32,
        reference_field_pic_indicator: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let reference_distance_flag: u32 =
                unsafe { ::std::mem::transmute(reference_distance_flag) };
            reference_distance_flag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 5u8, {
            let reference_distance: u32 = unsafe { ::std::mem::transmute(reference_distance) };
            reference_distance as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let num_reference_pictures: u32 =
                unsafe { ::std::mem::transmute(num_reference_pictures) };
            num_reference_pictures as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let reference_field_pic_indicator: u32 =
                unsafe { ::std::mem::transmute(reference_field_pic_indicator) };
            reference_field_pic_indicator as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_7"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_7>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_7"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_7>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_7::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_7, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_7::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_7, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_8 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1 {
    #[inline]
    pub fn mv_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_mv_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn mv_mode2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_mv_mode2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn mv_table(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_mv_table(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn two_mv_block_pattern_table(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_two_mv_block_pattern_table(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn four_mv_switch(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_four_mv_switch(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn four_mv_block_pattern_table(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_four_mv_block_pattern_table(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_mv_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_extended_mv_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_mv_range(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_extended_mv_range(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_dmv_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_extended_dmv_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_dmv_range(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_extended_dmv_range(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        mv_mode: u32,
        mv_mode2: u32,
        mv_table: u32,
        two_mv_block_pattern_table: u32,
        four_mv_switch: u32,
        four_mv_block_pattern_table: u32,
        extended_mv_flag: u32,
        extended_mv_range: u32,
        extended_dmv_flag: u32,
        extended_dmv_range: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let mv_mode: u32 = unsafe { ::std::mem::transmute(mv_mode) };
            mv_mode as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let mv_mode2: u32 = unsafe { ::std::mem::transmute(mv_mode2) };
            mv_mode2 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 3u8, {
            let mv_table: u32 = unsafe { ::std::mem::transmute(mv_table) };
            mv_table as u64
        });
        __bindgen_bitfield_unit.set(9usize, 2u8, {
            let two_mv_block_pattern_table: u32 =
                unsafe { ::std::mem::transmute(two_mv_block_pattern_table) };
            two_mv_block_pattern_table as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let four_mv_switch: u32 = unsafe { ::std::mem::transmute(four_mv_switch) };
            four_mv_switch as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let four_mv_block_pattern_table: u32 =
                unsafe { ::std::mem::transmute(four_mv_block_pattern_table) };
            four_mv_block_pattern_table as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let extended_mv_flag: u32 = unsafe { ::std::mem::transmute(extended_mv_flag) };
            extended_mv_flag as u64
        });
        __bindgen_bitfield_unit.set(15usize, 2u8, {
            let extended_mv_range: u32 = unsafe { ::std::mem::transmute(extended_mv_range) };
            extended_mv_range as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let extended_dmv_flag: u32 = unsafe { ::std::mem::transmute(extended_dmv_flag) };
            extended_dmv_flag as u64
        });
        __bindgen_bitfield_unit.set(18usize, 2u8, {
            let extended_dmv_range: u32 = unsafe { ::std::mem::transmute(extended_dmv_range) };
            extended_dmv_range as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_8"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_8>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_8"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_8>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_8::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_8, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_8::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_8, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_9 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1 {
    #[inline]
    pub fn dquant(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dquant(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn quantizer(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_quantizer(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn half_qp(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_half_qp(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pic_quantizer_scale(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_pic_quantizer_scale(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn pic_quantizer_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pic_quantizer_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_frame(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dq_frame(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_profile(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dq_profile(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_sb_edge(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dq_sb_edge(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_db_edge(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dq_db_edge(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_binary_level(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dq_binary_level(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn alt_pic_quantizer(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_alt_pic_quantizer(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        dquant: u32,
        quantizer: u32,
        half_qp: u32,
        pic_quantizer_scale: u32,
        pic_quantizer_type: u32,
        dq_frame: u32,
        dq_profile: u32,
        dq_sb_edge: u32,
        dq_db_edge: u32,
        dq_binary_level: u32,
        alt_pic_quantizer: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let dquant: u32 = unsafe { ::std::mem::transmute(dquant) };
            dquant as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let quantizer: u32 = unsafe { ::std::mem::transmute(quantizer) };
            quantizer as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let half_qp: u32 = unsafe { ::std::mem::transmute(half_qp) };
            half_qp as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let pic_quantizer_scale: u32 = unsafe { ::std::mem::transmute(pic_quantizer_scale) };
            pic_quantizer_scale as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let pic_quantizer_type: u32 = unsafe { ::std::mem::transmute(pic_quantizer_type) };
            pic_quantizer_type as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let dq_frame: u32 = unsafe { ::std::mem::transmute(dq_frame) };
            dq_frame as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let dq_profile: u32 = unsafe { ::std::mem::transmute(dq_profile) };
            dq_profile as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let dq_sb_edge: u32 = unsafe { ::std::mem::transmute(dq_sb_edge) };
            dq_sb_edge as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let dq_db_edge: u32 = unsafe { ::std::mem::transmute(dq_db_edge) };
            dq_db_edge as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let dq_binary_level: u32 = unsafe { ::std::mem::transmute(dq_binary_level) };
            dq_binary_level as u64
        });
        __bindgen_bitfield_unit.set(19usize, 5u8, {
            let alt_pic_quantizer: u32 = unsafe { ::std::mem::transmute(alt_pic_quantizer) };
            alt_pic_quantizer as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_9"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_9>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_9"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_9>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_9::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_9, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_9::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_9, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_10 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_10__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_10__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_10__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_10__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_10__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferVC1__bindgen_ty_10__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferVC1__bindgen_ty_10__bindgen_ty_1 {
    #[inline]
    pub fn variable_sized_transform_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_variable_sized_transform_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mb_level_transform_type_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mb_level_transform_type_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_level_transform_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_frame_level_transform_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn transform_ac_codingset_idx1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_transform_ac_codingset_idx1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn transform_ac_codingset_idx2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_transform_ac_codingset_idx2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn intra_transform_dc_table(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_intra_transform_dc_table(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        variable_sized_transform_flag: u32,
        mb_level_transform_type_flag: u32,
        frame_level_transform_type: u32,
        transform_ac_codingset_idx1: u32,
        transform_ac_codingset_idx2: u32,
        intra_transform_dc_table: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let variable_sized_transform_flag: u32 =
                unsafe { ::std::mem::transmute(variable_sized_transform_flag) };
            variable_sized_transform_flag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let mb_level_transform_type_flag: u32 =
                unsafe { ::std::mem::transmute(mb_level_transform_type_flag) };
            mb_level_transform_type_flag as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let frame_level_transform_type: u32 =
                unsafe { ::std::mem::transmute(frame_level_transform_type) };
            frame_level_transform_type as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let transform_ac_codingset_idx1: u32 =
                unsafe { ::std::mem::transmute(transform_ac_codingset_idx1) };
            transform_ac_codingset_idx1 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let transform_ac_codingset_idx2: u32 =
                unsafe { ::std::mem::transmute(transform_ac_codingset_idx2) };
            transform_ac_codingset_idx2 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let intra_transform_dc_table: u32 =
                unsafe { ::std::mem::transmute(intra_transform_dc_table) };
            intra_transform_dc_table as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1__bindgen_ty_10"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_10>() - 4usize];
    ["Alignment of _VAPictureParameterBufferVC1__bindgen_ty_10"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_10>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_10::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_10, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1__bindgen_ty_10::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1__bindgen_ty_10, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferVC1"]
        [::std::mem::size_of::<_VAPictureParameterBufferVC1>() - 104usize];
    ["Alignment of _VAPictureParameterBufferVC1"]
        [::std::mem::align_of::<_VAPictureParameterBufferVC1>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1::forward_reference_picture"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, forward_reference_picture) - 0usize];
    ["Offset of field: _VAPictureParameterBufferVC1::backward_reference_picture"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, backward_reference_picture) - 4usize];
    ["Offset of field: _VAPictureParameterBufferVC1::inloop_decoded_picture"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, inloop_decoded_picture) - 8usize];
    ["Offset of field: _VAPictureParameterBufferVC1::sequence_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, sequence_fields) - 12usize];
    ["Offset of field: _VAPictureParameterBufferVC1::coded_width"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, coded_width) - 16usize];
    ["Offset of field: _VAPictureParameterBufferVC1::coded_height"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, coded_height) - 18usize];
    ["Offset of field: _VAPictureParameterBufferVC1::entrypoint_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, entrypoint_fields) - 20usize];
    ["Offset of field: _VAPictureParameterBufferVC1::conditional_overlap_flag"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, conditional_overlap_flag) - 24usize];
    ["Offset of field: _VAPictureParameterBufferVC1::fast_uvmc_flag"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, fast_uvmc_flag) - 25usize];
    ["Offset of field: _VAPictureParameterBufferVC1::range_mapping_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, range_mapping_fields) - 28usize];
    ["Offset of field: _VAPictureParameterBufferVC1::b_picture_fraction"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, b_picture_fraction) - 32usize];
    ["Offset of field: _VAPictureParameterBufferVC1::cbp_table"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, cbp_table) - 33usize];
    ["Offset of field: _VAPictureParameterBufferVC1::mb_mode_table"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, mb_mode_table) - 34usize];
    ["Offset of field: _VAPictureParameterBufferVC1::range_reduction_frame"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, range_reduction_frame) - 35usize];
    ["Offset of field: _VAPictureParameterBufferVC1::rounding_control"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, rounding_control) - 36usize];
    ["Offset of field: _VAPictureParameterBufferVC1::post_processing"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, post_processing) - 37usize];
    ["Offset of field: _VAPictureParameterBufferVC1::picture_resolution_index"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, picture_resolution_index) - 38usize];
    ["Offset of field: _VAPictureParameterBufferVC1::luma_scale"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, luma_scale) - 39usize];
    ["Offset of field: _VAPictureParameterBufferVC1::luma_shift"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, luma_shift) - 40usize];
    ["Offset of field: _VAPictureParameterBufferVC1::picture_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, picture_fields) - 44usize];
    ["Offset of field: _VAPictureParameterBufferVC1::raw_coding"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, raw_coding) - 48usize];
    ["Offset of field: _VAPictureParameterBufferVC1::bitplane_present"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, bitplane_present) - 52usize];
    ["Offset of field: _VAPictureParameterBufferVC1::reference_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, reference_fields) - 56usize];
    ["Offset of field: _VAPictureParameterBufferVC1::mv_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, mv_fields) - 60usize];
    ["Offset of field: _VAPictureParameterBufferVC1::pic_quantizer_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, pic_quantizer_fields) - 64usize];
    ["Offset of field: _VAPictureParameterBufferVC1::transform_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, transform_fields) - 68usize];
    ["Offset of field: _VAPictureParameterBufferVC1::luma_scale2"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, luma_scale2) - 72usize];
    ["Offset of field: _VAPictureParameterBufferVC1::luma_shift2"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, luma_shift2) - 73usize];
    ["Offset of field: _VAPictureParameterBufferVC1::intensity_compensation_field"][::std::mem::offset_of!(
        _VAPictureParameterBufferVC1,
        intensity_compensation_field
    ) - 74usize];
    ["Offset of field: _VAPictureParameterBufferVC1::va_reserved"]
        [::std::mem::offset_of!(_VAPictureParameterBufferVC1, va_reserved) - 76usize];
};
pub type VAPictureParameterBufferVC1 = _VAPictureParameterBufferVC1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferVC1 {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
    pub macroblock_offset: u32,
    pub slice_vertical_position: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASliceParameterBufferVC1"]
        [::std::mem::size_of::<_VASliceParameterBufferVC1>() - 36usize];
    ["Alignment of _VASliceParameterBufferVC1"]
        [::std::mem::align_of::<_VASliceParameterBufferVC1>() - 4usize];
    ["Offset of field: _VASliceParameterBufferVC1::slice_data_size"]
        [::std::mem::offset_of!(_VASliceParameterBufferVC1, slice_data_size) - 0usize];
    ["Offset of field: _VASliceParameterBufferVC1::slice_data_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferVC1, slice_data_offset) - 4usize];
    ["Offset of field: _VASliceParameterBufferVC1::slice_data_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferVC1, slice_data_flag) - 8usize];
    ["Offset of field: _VASliceParameterBufferVC1::macroblock_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferVC1, macroblock_offset) - 12usize];
    ["Offset of field: _VASliceParameterBufferVC1::slice_vertical_position"]
        [::std::mem::offset_of!(_VASliceParameterBufferVC1, slice_vertical_position) - 16usize];
    ["Offset of field: _VASliceParameterBufferVC1::va_reserved"]
        [::std::mem::offset_of!(_VASliceParameterBufferVC1, va_reserved) - 20usize];
};
pub type VASliceParameterBufferVC1 = _VASliceParameterBufferVC1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureH264 {
    pub picture_id: VASurfaceID,
    pub frame_idx: u32,
    pub flags: u32,
    pub TopFieldOrderCnt: i32,
    pub BottomFieldOrderCnt: i32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureH264"][::std::mem::size_of::<_VAPictureH264>() - 36usize];
    ["Alignment of _VAPictureH264"][::std::mem::align_of::<_VAPictureH264>() - 4usize];
    ["Offset of field: _VAPictureH264::picture_id"]
        [::std::mem::offset_of!(_VAPictureH264, picture_id) - 0usize];
    ["Offset of field: _VAPictureH264::frame_idx"]
        [::std::mem::offset_of!(_VAPictureH264, frame_idx) - 4usize];
    ["Offset of field: _VAPictureH264::flags"]
        [::std::mem::offset_of!(_VAPictureH264, flags) - 8usize];
    ["Offset of field: _VAPictureH264::TopFieldOrderCnt"]
        [::std::mem::offset_of!(_VAPictureH264, TopFieldOrderCnt) - 12usize];
    ["Offset of field: _VAPictureH264::BottomFieldOrderCnt"]
        [::std::mem::offset_of!(_VAPictureH264, BottomFieldOrderCnt) - 16usize];
    ["Offset of field: _VAPictureH264::va_reserved"]
        [::std::mem::offset_of!(_VAPictureH264, va_reserved) - 20usize];
};
pub type VAPictureH264 = _VAPictureH264;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAPictureParameterBufferH264 {
    pub CurrPic: VAPictureH264,
    pub ReferenceFrames: [VAPictureH264; 16usize],
    pub picture_width_in_mbs_minus1: u16,
    pub picture_height_in_mbs_minus1: u16,
    pub bit_depth_luma_minus8: u8,
    pub bit_depth_chroma_minus8: u8,
    pub num_ref_frames: u8,
    pub seq_fields: _VAPictureParameterBufferH264__bindgen_ty_1,
    pub num_slice_groups_minus1: u8,
    pub slice_group_map_type: u8,
    pub slice_group_change_rate_minus1: u16,
    pub pic_init_qp_minus26: i8,
    pub pic_init_qs_minus26: i8,
    pub chroma_qp_index_offset: i8,
    pub second_chroma_qp_index_offset: i8,
    pub pic_fields: _VAPictureParameterBufferH264__bindgen_ty_2,
    pub frame_num: u16,
    pub va_reserved: [u32; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferH264__bindgen_ty_1 {
    pub bits: _VAPictureParameterBufferH264__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferH264__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferH264__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferH264__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferH264__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferH264__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferH264__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn chroma_format_idc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_chroma_format_idc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn residual_colour_transform_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_residual_colour_transform_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn gaps_in_frame_num_value_allowed_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_gaps_in_frame_num_value_allowed_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_mbs_only_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_frame_mbs_only_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mb_adaptive_frame_field_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mb_adaptive_frame_field_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn direct_8x8_inference_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_direct_8x8_inference_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn MinLumaBiPredSize8x8(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_MinLumaBiPredSize8x8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn log2_max_frame_num_minus4(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_log2_max_frame_num_minus4(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn pic_order_cnt_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_pic_order_cnt_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn log2_max_pic_order_cnt_lsb_minus4(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_log2_max_pic_order_cnt_lsb_minus4(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn delta_pic_order_always_zero_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_delta_pic_order_always_zero_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        chroma_format_idc: u32,
        residual_colour_transform_flag: u32,
        gaps_in_frame_num_value_allowed_flag: u32,
        frame_mbs_only_flag: u32,
        mb_adaptive_frame_field_flag: u32,
        direct_8x8_inference_flag: u32,
        MinLumaBiPredSize8x8: u32,
        log2_max_frame_num_minus4: u32,
        pic_order_cnt_type: u32,
        log2_max_pic_order_cnt_lsb_minus4: u32,
        delta_pic_order_always_zero_flag: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let chroma_format_idc: u32 = unsafe { ::std::mem::transmute(chroma_format_idc) };
            chroma_format_idc as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let residual_colour_transform_flag: u32 =
                unsafe { ::std::mem::transmute(residual_colour_transform_flag) };
            residual_colour_transform_flag as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let gaps_in_frame_num_value_allowed_flag: u32 =
                unsafe { ::std::mem::transmute(gaps_in_frame_num_value_allowed_flag) };
            gaps_in_frame_num_value_allowed_flag as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let frame_mbs_only_flag: u32 = unsafe { ::std::mem::transmute(frame_mbs_only_flag) };
            frame_mbs_only_flag as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let mb_adaptive_frame_field_flag: u32 =
                unsafe { ::std::mem::transmute(mb_adaptive_frame_field_flag) };
            mb_adaptive_frame_field_flag as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let direct_8x8_inference_flag: u32 =
                unsafe { ::std::mem::transmute(direct_8x8_inference_flag) };
            direct_8x8_inference_flag as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let MinLumaBiPredSize8x8: u32 = unsafe { ::std::mem::transmute(MinLumaBiPredSize8x8) };
            MinLumaBiPredSize8x8 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let log2_max_frame_num_minus4: u32 =
                unsafe { ::std::mem::transmute(log2_max_frame_num_minus4) };
            log2_max_frame_num_minus4 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let pic_order_cnt_type: u32 = unsafe { ::std::mem::transmute(pic_order_cnt_type) };
            pic_order_cnt_type as u64
        });
        __bindgen_bitfield_unit.set(14usize, 4u8, {
            let log2_max_pic_order_cnt_lsb_minus4: u32 =
                unsafe { ::std::mem::transmute(log2_max_pic_order_cnt_lsb_minus4) };
            log2_max_pic_order_cnt_lsb_minus4 as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let delta_pic_order_always_zero_flag: u32 =
                unsafe { ::std::mem::transmute(delta_pic_order_always_zero_flag) };
            delta_pic_order_always_zero_flag as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferH264__bindgen_ty_1"]
        [::std::mem::size_of::<_VAPictureParameterBufferH264__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAPictureParameterBufferH264__bindgen_ty_1"]
        [::std::mem::align_of::<_VAPictureParameterBufferH264__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferH264__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferH264__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264__bindgen_ty_1, value) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferH264__bindgen_ty_2 {
    pub bits: _VAPictureParameterBufferH264__bindgen_ty_2__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferH264__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferH264__bindgen_ty_2__bindgen_ty_1"][::std::mem::size_of::<
        _VAPictureParameterBufferH264__bindgen_ty_2__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _VAPictureParameterBufferH264__bindgen_ty_2__bindgen_ty_1"][::std::mem::align_of::<
        _VAPictureParameterBufferH264__bindgen_ty_2__bindgen_ty_1,
    >() - 4usize];
};
impl _VAPictureParameterBufferH264__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn entropy_coding_mode_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_entropy_coding_mode_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn weighted_pred_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_weighted_pred_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn weighted_bipred_idc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_weighted_bipred_idc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn transform_8x8_mode_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transform_8x8_mode_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn field_pic_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_field_pic_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn constrained_intra_pred_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_constrained_intra_pred_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pic_order_present_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pic_order_present_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn deblocking_filter_control_present_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_deblocking_filter_control_present_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn redundant_pic_cnt_present_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_redundant_pic_cnt_present_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reference_pic_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reference_pic_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        entropy_coding_mode_flag: u32,
        weighted_pred_flag: u32,
        weighted_bipred_idc: u32,
        transform_8x8_mode_flag: u32,
        field_pic_flag: u32,
        constrained_intra_pred_flag: u32,
        pic_order_present_flag: u32,
        deblocking_filter_control_present_flag: u32,
        redundant_pic_cnt_present_flag: u32,
        reference_pic_flag: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let entropy_coding_mode_flag: u32 =
                unsafe { ::std::mem::transmute(entropy_coding_mode_flag) };
            entropy_coding_mode_flag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let weighted_pred_flag: u32 = unsafe { ::std::mem::transmute(weighted_pred_flag) };
            weighted_pred_flag as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let weighted_bipred_idc: u32 = unsafe { ::std::mem::transmute(weighted_bipred_idc) };
            weighted_bipred_idc as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let transform_8x8_mode_flag: u32 =
                unsafe { ::std::mem::transmute(transform_8x8_mode_flag) };
            transform_8x8_mode_flag as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let field_pic_flag: u32 = unsafe { ::std::mem::transmute(field_pic_flag) };
            field_pic_flag as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let constrained_intra_pred_flag: u32 =
                unsafe { ::std::mem::transmute(constrained_intra_pred_flag) };
            constrained_intra_pred_flag as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let pic_order_present_flag: u32 =
                unsafe { ::std::mem::transmute(pic_order_present_flag) };
            pic_order_present_flag as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let deblocking_filter_control_present_flag: u32 =
                unsafe { ::std::mem::transmute(deblocking_filter_control_present_flag) };
            deblocking_filter_control_present_flag as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let redundant_pic_cnt_present_flag: u32 =
                unsafe { ::std::mem::transmute(redundant_pic_cnt_present_flag) };
            redundant_pic_cnt_present_flag as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let reference_pic_flag: u32 = unsafe { ::std::mem::transmute(reference_pic_flag) };
            reference_pic_flag as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferH264__bindgen_ty_2"]
        [::std::mem::size_of::<_VAPictureParameterBufferH264__bindgen_ty_2>() - 4usize];
    ["Alignment of _VAPictureParameterBufferH264__bindgen_ty_2"]
        [::std::mem::align_of::<_VAPictureParameterBufferH264__bindgen_ty_2>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferH264__bindgen_ty_2::bits"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264__bindgen_ty_2, bits) - 0usize];
    ["Offset of field: _VAPictureParameterBufferH264__bindgen_ty_2::value"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264__bindgen_ty_2, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAPictureParameterBufferH264"]
        [::std::mem::size_of::<_VAPictureParameterBufferH264>() - 672usize];
    ["Alignment of _VAPictureParameterBufferH264"]
        [::std::mem::align_of::<_VAPictureParameterBufferH264>() - 4usize];
    ["Offset of field: _VAPictureParameterBufferH264::CurrPic"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, CurrPic) - 0usize];
    ["Offset of field: _VAPictureParameterBufferH264::ReferenceFrames"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, ReferenceFrames) - 36usize];
    ["Offset of field: _VAPictureParameterBufferH264::picture_width_in_mbs_minus1"][::std::mem::offset_of!(
        _VAPictureParameterBufferH264,
        picture_width_in_mbs_minus1
    ) - 612usize];
    ["Offset of field: _VAPictureParameterBufferH264::picture_height_in_mbs_minus1"][::std::mem::offset_of!(
        _VAPictureParameterBufferH264,
        picture_height_in_mbs_minus1
    ) - 614usize];
    ["Offset of field: _VAPictureParameterBufferH264::bit_depth_luma_minus8"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, bit_depth_luma_minus8) - 616usize];
    ["Offset of field: _VAPictureParameterBufferH264::bit_depth_chroma_minus8"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, bit_depth_chroma_minus8) - 617usize];
    ["Offset of field: _VAPictureParameterBufferH264::num_ref_frames"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, num_ref_frames) - 618usize];
    ["Offset of field: _VAPictureParameterBufferH264::seq_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, seq_fields) - 620usize];
    ["Offset of field: _VAPictureParameterBufferH264::num_slice_groups_minus1"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, num_slice_groups_minus1) - 624usize];
    ["Offset of field: _VAPictureParameterBufferH264::slice_group_map_type"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, slice_group_map_type) - 625usize];
    ["Offset of field: _VAPictureParameterBufferH264::slice_group_change_rate_minus1"][::std::mem::offset_of!(
        _VAPictureParameterBufferH264,
        slice_group_change_rate_minus1
    )
        - 626usize];
    ["Offset of field: _VAPictureParameterBufferH264::pic_init_qp_minus26"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, pic_init_qp_minus26) - 628usize];
    ["Offset of field: _VAPictureParameterBufferH264::pic_init_qs_minus26"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, pic_init_qs_minus26) - 629usize];
    ["Offset of field: _VAPictureParameterBufferH264::chroma_qp_index_offset"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, chroma_qp_index_offset) - 630usize];
    ["Offset of field: _VAPictureParameterBufferH264::second_chroma_qp_index_offset"][::std::mem::offset_of!(
        _VAPictureParameterBufferH264,
        second_chroma_qp_index_offset
    ) - 631usize];
    ["Offset of field: _VAPictureParameterBufferH264::pic_fields"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, pic_fields) - 632usize];
    ["Offset of field: _VAPictureParameterBufferH264::frame_num"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, frame_num) - 636usize];
    ["Offset of field: _VAPictureParameterBufferH264::va_reserved"]
        [::std::mem::offset_of!(_VAPictureParameterBufferH264, va_reserved) - 640usize];
};
pub type VAPictureParameterBufferH264 = _VAPictureParameterBufferH264;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAIQMatrixBufferH264 {
    pub ScalingList4x4: [[u8; 16usize]; 6usize],
    pub ScalingList8x8: [[u8; 64usize]; 2usize],
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAIQMatrixBufferH264"][::std::mem::size_of::<_VAIQMatrixBufferH264>() - 240usize];
    ["Alignment of _VAIQMatrixBufferH264"]
        [::std::mem::align_of::<_VAIQMatrixBufferH264>() - 4usize];
    ["Offset of field: _VAIQMatrixBufferH264::ScalingList4x4"]
        [::std::mem::offset_of!(_VAIQMatrixBufferH264, ScalingList4x4) - 0usize];
    ["Offset of field: _VAIQMatrixBufferH264::ScalingList8x8"]
        [::std::mem::offset_of!(_VAIQMatrixBufferH264, ScalingList8x8) - 96usize];
    ["Offset of field: _VAIQMatrixBufferH264::va_reserved"]
        [::std::mem::offset_of!(_VAIQMatrixBufferH264, va_reserved) - 224usize];
};
pub type VAIQMatrixBufferH264 = _VAIQMatrixBufferH264;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferH264 {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
    pub slice_data_bit_offset: u16,
    pub first_mb_in_slice: u16,
    pub slice_type: u8,
    pub direct_spatial_mv_pred_flag: u8,
    pub num_ref_idx_l0_active_minus1: u8,
    pub num_ref_idx_l1_active_minus1: u8,
    pub cabac_init_idc: u8,
    pub slice_qp_delta: i8,
    pub disable_deblocking_filter_idc: u8,
    pub slice_alpha_c0_offset_div2: i8,
    pub slice_beta_offset_div2: i8,
    pub RefPicList0: [VAPictureH264; 32usize],
    pub RefPicList1: [VAPictureH264; 32usize],
    pub luma_log2_weight_denom: u8,
    pub chroma_log2_weight_denom: u8,
    pub luma_weight_l0_flag: u8,
    pub luma_weight_l0: [i16; 32usize],
    pub luma_offset_l0: [i16; 32usize],
    pub chroma_weight_l0_flag: u8,
    pub chroma_weight_l0: [[i16; 2usize]; 32usize],
    pub chroma_offset_l0: [[i16; 2usize]; 32usize],
    pub luma_weight_l1_flag: u8,
    pub luma_weight_l1: [i16; 32usize],
    pub luma_offset_l1: [i16; 32usize],
    pub chroma_weight_l1_flag: u8,
    pub chroma_weight_l1: [[i16; 2usize]; 32usize],
    pub chroma_offset_l1: [[i16; 2usize]; 32usize],
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASliceParameterBufferH264"]
        [::std::mem::size_of::<_VASliceParameterBufferH264>() - 3128usize];
    ["Alignment of _VASliceParameterBufferH264"]
        [::std::mem::align_of::<_VASliceParameterBufferH264>() - 4usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_data_size"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_data_size) - 0usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_data_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_data_offset) - 4usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_data_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_data_flag) - 8usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_data_bit_offset"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_data_bit_offset) - 12usize];
    ["Offset of field: _VASliceParameterBufferH264::first_mb_in_slice"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, first_mb_in_slice) - 14usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_type"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_type) - 16usize];
    ["Offset of field: _VASliceParameterBufferH264::direct_spatial_mv_pred_flag"][::std::mem::offset_of!(
        _VASliceParameterBufferH264,
        direct_spatial_mv_pred_flag
    ) - 17usize];
    ["Offset of field: _VASliceParameterBufferH264::num_ref_idx_l0_active_minus1"][::std::mem::offset_of!(
        _VASliceParameterBufferH264,
        num_ref_idx_l0_active_minus1
    ) - 18usize];
    ["Offset of field: _VASliceParameterBufferH264::num_ref_idx_l1_active_minus1"][::std::mem::offset_of!(
        _VASliceParameterBufferH264,
        num_ref_idx_l1_active_minus1
    ) - 19usize];
    ["Offset of field: _VASliceParameterBufferH264::cabac_init_idc"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, cabac_init_idc) - 20usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_qp_delta"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_qp_delta) - 21usize];
    ["Offset of field: _VASliceParameterBufferH264::disable_deblocking_filter_idc"][::std::mem::offset_of!(
        _VASliceParameterBufferH264,
        disable_deblocking_filter_idc
    ) - 22usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_alpha_c0_offset_div2"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_alpha_c0_offset_div2) - 23usize];
    ["Offset of field: _VASliceParameterBufferH264::slice_beta_offset_div2"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, slice_beta_offset_div2) - 24usize];
    ["Offset of field: _VASliceParameterBufferH264::RefPicList0"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, RefPicList0) - 28usize];
    ["Offset of field: _VASliceParameterBufferH264::RefPicList1"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, RefPicList1) - 1180usize];
    ["Offset of field: _VASliceParameterBufferH264::luma_log2_weight_denom"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, luma_log2_weight_denom) - 2332usize];
    ["Offset of field: _VASliceParameterBufferH264::chroma_log2_weight_denom"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, chroma_log2_weight_denom) - 2333usize];
    ["Offset of field: _VASliceParameterBufferH264::luma_weight_l0_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, luma_weight_l0_flag) - 2334usize];
    ["Offset of field: _VASliceParameterBufferH264::luma_weight_l0"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, luma_weight_l0) - 2336usize];
    ["Offset of field: _VASliceParameterBufferH264::luma_offset_l0"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, luma_offset_l0) - 2400usize];
    ["Offset of field: _VASliceParameterBufferH264::chroma_weight_l0_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, chroma_weight_l0_flag) - 2464usize];
    ["Offset of field: _VASliceParameterBufferH264::chroma_weight_l0"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, chroma_weight_l0) - 2466usize];
    ["Offset of field: _VASliceParameterBufferH264::chroma_offset_l0"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, chroma_offset_l0) - 2594usize];
    ["Offset of field: _VASliceParameterBufferH264::luma_weight_l1_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, luma_weight_l1_flag) - 2722usize];
    ["Offset of field: _VASliceParameterBufferH264::luma_weight_l1"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, luma_weight_l1) - 2724usize];
    ["Offset of field: _VASliceParameterBufferH264::luma_offset_l1"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, luma_offset_l1) - 2788usize];
    ["Offset of field: _VASliceParameterBufferH264::chroma_weight_l1_flag"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, chroma_weight_l1_flag) - 2852usize];
    ["Offset of field: _VASliceParameterBufferH264::chroma_weight_l1"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, chroma_weight_l1) - 2854usize];
    ["Offset of field: _VASliceParameterBufferH264::chroma_offset_l1"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, chroma_offset_l1) - 2982usize];
    ["Offset of field: _VASliceParameterBufferH264::va_reserved"]
        [::std::mem::offset_of!(_VASliceParameterBufferH264, va_reserved) - 3112usize];
};
pub type VASliceParameterBufferH264 = _VASliceParameterBufferH264;
pub const VAEncPictureTypeIntra: VAEncPictureType = 0;
pub const VAEncPictureTypePredictive: VAEncPictureType = 1;
pub const VAEncPictureTypeBidirectional: VAEncPictureType = 2;
pub type VAEncPictureType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncSliceParameterBuffer {
    pub start_row_number: u32,
    pub slice_height: u32,
    pub slice_flags: _VAEncSliceParameterBuffer__bindgen_ty_1,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncSliceParameterBuffer__bindgen_ty_1 {
    pub bits: _VAEncSliceParameterBuffer__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncSliceParameterBuffer__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncSliceParameterBuffer__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncSliceParameterBuffer__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncSliceParameterBuffer__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncSliceParameterBuffer__bindgen_ty_1__bindgen_ty_1>() - 4usize];
};
impl _VAEncSliceParameterBuffer__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn is_intra(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_intra(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disable_deblocking_filter_idc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_disable_deblocking_filter_idc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn uses_long_term_ref(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_uses_long_term_ref(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_long_term_ref(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_long_term_ref(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        is_intra: u32,
        disable_deblocking_filter_idc: u32,
        uses_long_term_ref: u32,
        is_long_term_ref: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let is_intra: u32 = unsafe { ::std::mem::transmute(is_intra) };
            is_intra as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let disable_deblocking_filter_idc: u32 =
                unsafe { ::std::mem::transmute(disable_deblocking_filter_idc) };
            disable_deblocking_filter_idc as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let uses_long_term_ref: u32 = unsafe { ::std::mem::transmute(uses_long_term_ref) };
            uses_long_term_ref as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let is_long_term_ref: u32 = unsafe { ::std::mem::transmute(is_long_term_ref) };
            is_long_term_ref as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncSliceParameterBuffer__bindgen_ty_1"]
        [::std::mem::size_of::<_VAEncSliceParameterBuffer__bindgen_ty_1>() - 4usize];
    ["Alignment of _VAEncSliceParameterBuffer__bindgen_ty_1"]
        [::std::mem::align_of::<_VAEncSliceParameterBuffer__bindgen_ty_1>() - 4usize];
    ["Offset of field: _VAEncSliceParameterBuffer__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(_VAEncSliceParameterBuffer__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: _VAEncSliceParameterBuffer__bindgen_ty_1::value"]
        [::std::mem::offset_of!(_VAEncSliceParameterBuffer__bindgen_ty_1, value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncSliceParameterBuffer"]
        [::std::mem::size_of::<_VAEncSliceParameterBuffer>() - 28usize];
    ["Alignment of _VAEncSliceParameterBuffer"]
        [::std::mem::align_of::<_VAEncSliceParameterBuffer>() - 4usize];
    ["Offset of field: _VAEncSliceParameterBuffer::start_row_number"]
        [::std::mem::offset_of!(_VAEncSliceParameterBuffer, start_row_number) - 0usize];
    ["Offset of field: _VAEncSliceParameterBuffer::slice_height"]
        [::std::mem::offset_of!(_VAEncSliceParameterBuffer, slice_height) - 4usize];
    ["Offset of field: _VAEncSliceParameterBuffer::slice_flags"]
        [::std::mem::offset_of!(_VAEncSliceParameterBuffer, slice_flags) - 8usize];
    ["Offset of field: _VAEncSliceParameterBuffer::va_reserved"]
        [::std::mem::offset_of!(_VAEncSliceParameterBuffer, va_reserved) - 12usize];
};
pub type VAEncSliceParameterBuffer = _VAEncSliceParameterBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncSequenceParameterBufferH263 {
    pub intra_period: u32,
    pub bits_per_second: u32,
    pub frame_rate: u32,
    pub initial_qp: u32,
    pub min_qp: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncSequenceParameterBufferH263"]
        [::std::mem::size_of::<_VAEncSequenceParameterBufferH263>() - 36usize];
    ["Alignment of _VAEncSequenceParameterBufferH263"]
        [::std::mem::align_of::<_VAEncSequenceParameterBufferH263>() - 4usize];
    ["Offset of field: _VAEncSequenceParameterBufferH263::intra_period"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferH263, intra_period) - 0usize];
    ["Offset of field: _VAEncSequenceParameterBufferH263::bits_per_second"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferH263, bits_per_second) - 4usize];
    ["Offset of field: _VAEncSequenceParameterBufferH263::frame_rate"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferH263, frame_rate) - 8usize];
    ["Offset of field: _VAEncSequenceParameterBufferH263::initial_qp"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferH263, initial_qp) - 12usize];
    ["Offset of field: _VAEncSequenceParameterBufferH263::min_qp"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferH263, min_qp) - 16usize];
    ["Offset of field: _VAEncSequenceParameterBufferH263::va_reserved"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferH263, va_reserved) - 20usize];
};
pub type VAEncSequenceParameterBufferH263 = _VAEncSequenceParameterBufferH263;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncPictureParameterBufferH263 {
    pub reference_picture: VASurfaceID,
    pub reconstructed_picture: VASurfaceID,
    pub coded_buf: VABufferID,
    pub picture_width: u16,
    pub picture_height: u16,
    pub picture_type: VAEncPictureType,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncPictureParameterBufferH263"]
        [::std::mem::size_of::<_VAEncPictureParameterBufferH263>() - 36usize];
    ["Alignment of _VAEncPictureParameterBufferH263"]
        [::std::mem::align_of::<_VAEncPictureParameterBufferH263>() - 4usize];
    ["Offset of field: _VAEncPictureParameterBufferH263::reference_picture"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferH263, reference_picture) - 0usize];
    ["Offset of field: _VAEncPictureParameterBufferH263::reconstructed_picture"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferH263, reconstructed_picture) - 4usize];
    ["Offset of field: _VAEncPictureParameterBufferH263::coded_buf"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferH263, coded_buf) - 8usize];
    ["Offset of field: _VAEncPictureParameterBufferH263::picture_width"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferH263, picture_width) - 12usize];
    ["Offset of field: _VAEncPictureParameterBufferH263::picture_height"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferH263, picture_height) - 14usize];
    ["Offset of field: _VAEncPictureParameterBufferH263::picture_type"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferH263, picture_type) - 16usize];
    ["Offset of field: _VAEncPictureParameterBufferH263::va_reserved"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferH263, va_reserved) - 20usize];
};
pub type VAEncPictureParameterBufferH263 = _VAEncPictureParameterBufferH263;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncSequenceParameterBufferMPEG4 {
    pub profile_and_level_indication: u8,
    pub intra_period: u32,
    pub video_object_layer_width: u32,
    pub video_object_layer_height: u32,
    pub vop_time_increment_resolution: u32,
    pub fixed_vop_rate: u32,
    pub fixed_vop_time_increment: u32,
    pub bits_per_second: u32,
    pub frame_rate: u32,
    pub initial_qp: u32,
    pub min_qp: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncSequenceParameterBufferMPEG4"]
        [::std::mem::size_of::<_VAEncSequenceParameterBufferMPEG4>() - 60usize];
    ["Alignment of _VAEncSequenceParameterBufferMPEG4"]
        [::std::mem::align_of::<_VAEncSequenceParameterBufferMPEG4>() - 4usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::profile_and_level_indication"][::std::mem::offset_of!(
        _VAEncSequenceParameterBufferMPEG4,
        profile_and_level_indication
    )
        - 0usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::intra_period"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferMPEG4, intra_period) - 4usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::video_object_layer_width"][::std::mem::offset_of!(
        _VAEncSequenceParameterBufferMPEG4,
        video_object_layer_width
    ) - 8usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::video_object_layer_height"][::std::mem::offset_of!(
        _VAEncSequenceParameterBufferMPEG4,
        video_object_layer_height
    ) - 12usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::vop_time_increment_resolution"][::std::mem::offset_of!(
        _VAEncSequenceParameterBufferMPEG4,
        vop_time_increment_resolution
    )
        - 16usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::fixed_vop_rate"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferMPEG4, fixed_vop_rate) - 20usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::fixed_vop_time_increment"][::std::mem::offset_of!(
        _VAEncSequenceParameterBufferMPEG4,
        fixed_vop_time_increment
    ) - 24usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::bits_per_second"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferMPEG4, bits_per_second) - 28usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::frame_rate"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferMPEG4, frame_rate) - 32usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::initial_qp"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferMPEG4, initial_qp) - 36usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::min_qp"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferMPEG4, min_qp) - 40usize];
    ["Offset of field: _VAEncSequenceParameterBufferMPEG4::va_reserved"]
        [::std::mem::offset_of!(_VAEncSequenceParameterBufferMPEG4, va_reserved) - 44usize];
};
pub type VAEncSequenceParameterBufferMPEG4 = _VAEncSequenceParameterBufferMPEG4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncPictureParameterBufferMPEG4 {
    pub reference_picture: VASurfaceID,
    pub reconstructed_picture: VASurfaceID,
    pub coded_buf: VABufferID,
    pub picture_width: u16,
    pub picture_height: u16,
    pub modulo_time_base: u32,
    pub vop_time_increment: u32,
    pub picture_type: VAEncPictureType,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAEncPictureParameterBufferMPEG4"]
        [::std::mem::size_of::<_VAEncPictureParameterBufferMPEG4>() - 44usize];
    ["Alignment of _VAEncPictureParameterBufferMPEG4"]
        [::std::mem::align_of::<_VAEncPictureParameterBufferMPEG4>() - 4usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::reference_picture"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, reference_picture) - 0usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::reconstructed_picture"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, reconstructed_picture) - 4usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::coded_buf"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, coded_buf) - 8usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::picture_width"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, picture_width) - 12usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::picture_height"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, picture_height) - 14usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::modulo_time_base"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, modulo_time_base) - 16usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::vop_time_increment"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, vop_time_increment) - 20usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::picture_type"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, picture_type) - 24usize];
    ["Offset of field: _VAEncPictureParameterBufferMPEG4::va_reserved"]
        [::std::mem::offset_of!(_VAEncPictureParameterBufferMPEG4, va_reserved) - 28usize];
};
pub type VAEncPictureParameterBufferMPEG4 = _VAEncPictureParameterBufferMPEG4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VACodedBufferSegment {
    pub size: u32,
    pub bit_offset: u32,
    pub status: u32,
    pub reserved: u32,
    pub buf: *mut ::std::os::raw::c_void,
    pub next: *mut ::std::os::raw::c_void,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VACodedBufferSegment"][::std::mem::size_of::<_VACodedBufferSegment>() - 48usize];
    ["Alignment of _VACodedBufferSegment"]
        [::std::mem::align_of::<_VACodedBufferSegment>() - 8usize];
    ["Offset of field: _VACodedBufferSegment::size"]
        [::std::mem::offset_of!(_VACodedBufferSegment, size) - 0usize];
    ["Offset of field: _VACodedBufferSegment::bit_offset"]
        [::std::mem::offset_of!(_VACodedBufferSegment, bit_offset) - 4usize];
    ["Offset of field: _VACodedBufferSegment::status"]
        [::std::mem::offset_of!(_VACodedBufferSegment, status) - 8usize];
    ["Offset of field: _VACodedBufferSegment::reserved"]
        [::std::mem::offset_of!(_VACodedBufferSegment, reserved) - 12usize];
    ["Offset of field: _VACodedBufferSegment::buf"]
        [::std::mem::offset_of!(_VACodedBufferSegment, buf) - 16usize];
    ["Offset of field: _VACodedBufferSegment::next"]
        [::std::mem::offset_of!(_VACodedBufferSegment, next) - 24usize];
    ["Offset of field: _VACodedBufferSegment::va_reserved"]
        [::std::mem::offset_of!(_VACodedBufferSegment, va_reserved) - 32usize];
};
pub type VACodedBufferSegment = _VACodedBufferSegment;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VABufferInfo {
    pub handle: usize,
    pub type_: u32,
    pub mem_type: u32,
    pub mem_size: usize,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VABufferInfo"][::std::mem::size_of::<VABufferInfo>() - 40usize];
    ["Alignment of VABufferInfo"][::std::mem::align_of::<VABufferInfo>() - 8usize];
    ["Offset of field: VABufferInfo::handle"]
        [::std::mem::offset_of!(VABufferInfo, handle) - 0usize];
    ["Offset of field: VABufferInfo::type_"][::std::mem::offset_of!(VABufferInfo, type_) - 8usize];
    ["Offset of field: VABufferInfo::mem_type"]
        [::std::mem::offset_of!(VABufferInfo, mem_type) - 12usize];
    ["Offset of field: VABufferInfo::mem_size"]
        [::std::mem::offset_of!(VABufferInfo, mem_size) - 16usize];
    ["Offset of field: VABufferInfo::va_reserved"]
        [::std::mem::offset_of!(VABufferInfo, va_reserved) - 24usize];
};
pub const VASurfaceRendering: VASurfaceStatus = 1;
pub const VASurfaceDisplaying: VASurfaceStatus = 2;
pub const VASurfaceReady: VASurfaceStatus = 4;
pub const VASurfaceSkipped: VASurfaceStatus = 8;
pub type VASurfaceStatus = ::std::os::raw::c_uint;
pub const VADecodeSliceMissing: VADecodeErrorType = 0;
pub const VADecodeMBError: VADecodeErrorType = 1;
pub const VADecodeReset: VADecodeErrorType = 2;
pub type VADecodeErrorType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASurfaceDecodeMBErrors {
    pub status: i32,
    pub start_mb: u32,
    pub end_mb: u32,
    pub decode_error_type: VADecodeErrorType,
    pub num_mb: u32,
    pub va_reserved: [u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VASurfaceDecodeMBErrors"]
        [::std::mem::size_of::<_VASurfaceDecodeMBErrors>() - 32usize];
    ["Alignment of _VASurfaceDecodeMBErrors"]
        [::std::mem::align_of::<_VASurfaceDecodeMBErrors>() - 4usize];
    ["Offset of field: _VASurfaceDecodeMBErrors::status"]
        [::std::mem::offset_of!(_VASurfaceDecodeMBErrors, status) - 0usize];
    ["Offset of field: _VASurfaceDecodeMBErrors::start_mb"]
        [::std::mem::offset_of!(_VASurfaceDecodeMBErrors, start_mb) - 4usize];
    ["Offset of field: _VASurfaceDecodeMBErrors::end_mb"]
        [::std::mem::offset_of!(_VASurfaceDecodeMBErrors, end_mb) - 8usize];
    ["Offset of field: _VASurfaceDecodeMBErrors::decode_error_type"]
        [::std::mem::offset_of!(_VASurfaceDecodeMBErrors, decode_error_type) - 12usize];
    ["Offset of field: _VASurfaceDecodeMBErrors::num_mb"]
        [::std::mem::offset_of!(_VASurfaceDecodeMBErrors, num_mb) - 16usize];
    ["Offset of field: _VASurfaceDecodeMBErrors::va_reserved"]
        [::std::mem::offset_of!(_VASurfaceDecodeMBErrors, va_reserved) - 20usize];
};
pub type VASurfaceDecodeMBErrors = _VASurfaceDecodeMBErrors;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAImageFormat {
    pub fourcc: u32,
    pub byte_order: u32,
    pub bits_per_pixel: u32,
    pub depth: u32,
    pub red_mask: u32,
    pub green_mask: u32,
    pub blue_mask: u32,
    pub alpha_mask: u32,
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VAImageFormat"][::std::mem::size_of::<_VAImageFormat>() - 48usize];
    ["Alignment of _VAImageFormat"][::std::mem::align_of::<_VAImageFormat>() - 4usize];
    ["Offset of field: _VAImageFormat::fourcc"]
        [::std::mem::offset_of!(_VAImageFormat, fourcc) - 0usize];
    ["Offset of field: _VAImageFormat::byte_order"]
        [::std::mem::offset_of!(_VAImageFormat, byte_order) - 4usize];
    ["Offset of field: _VAImageFormat::bits_per_pixel"]
        [::std::mem::offset_of!(_VAImageFormat, bits_per_pixel) - 8usize];
    ["Offset of field: _VAImageFormat::depth"]
        [::std::mem::offset_of!(_VAImageFormat, depth) - 12usize];
    ["Offset of field: _VAImageFormat::red_mask"]
        [::std::mem::offset_of!(_VAImageFormat, red_mask) - 16usize];
    ["Offset of field: _VAImageFormat::green_mask"]
        [::std::mem::offset_of!(_VAImageFormat, green_mask) - 20usize];
    ["Offset of field: _VAImageFormat::blue_mask"]
        [::std::mem::offset_of!(_VAImageFormat, blue_mask) - 24usize];
    ["Offset of field: _VAImageFormat::alpha_mask"]
        [::std::mem::offset_of!(_VAImageFormat, alpha_mask) - 28usize];
    ["Offset of field: _VAImageFormat::va_reserved"]
        [::std::mem::offset_of!(_VAImageFormat, va_reserved) - 32usize];
};
pub type VAImageFormat = _VAImageFormat;
pub type VAImageID = VAGenericID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAImage {
    pub image_id: VAImageID,
    pub format: VAImageFormat,
    pub buf: VABufferID,
    pub width: u16,
    pub height: u16,
    pub data_size: u32,
    pub num_planes: u32,
    pub pitches: [u32; 3usize],
    pub offsets: [u32; 3usize],
    pub num_palette_entries: i32,
    pub entry_bytes: i32,
    pub component_order: [i8; 4usize],
    pub va_reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
